[Killed] DecrementInteger
Address/ModRmAddress.php:54:5
     /**
      * {@inheritDoc}
      */
-    public function getAddress(int $offset = 0): int
+    public function getAddress(int $offset = -1): int
     {
         $disp = $this->offset;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressWithoutOffsetResolvesCorrectly with data set #0 (4634635, 9746, 4, 0, 4644381)
Failed asserting that 4644380 matches expected 4644381.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:103

FAILURES!
Tests: 40, Assertions: 40, Failures: 1.

[Killed] IncrementInteger
Address/ModRmAddress.php:54:5
     /**
      * {@inheritDoc}
      */
-    public function getAddress(int $offset = 0): int
+    public function getAddress(int $offset = 1): int
     {
         $disp = $this->offset;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressWithoutOffsetResolvesCorrectly with data set #0 (4634635, 9746, 4, 0, 4644381)
Failed asserting that 4644382 matches expected 4644381.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:103

FAILURES!
Tests: 40, Assertions: 40, Failures: 1.

[Killed] Minus
Address/ModRmAddress.php:61:13
         // Handle two's compliment addresses.
         if ($this->displacement) {
             // This will generate the appropriate sized mask for the operation size.
-            $dispMask = (256 ** $this->displacement) - 1;
+            $dispMask = 256 ** $this->displacement + 1;
             $dispShift = (8 * $this->displacement) - 1;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that -4290332663 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] IncrementInteger
Address/ModRmAddress.php:61:13
         // Handle two's compliment addresses.
         if ($this->displacement) {
             // This will generate the appropriate sized mask for the operation size.
-            $dispMask = (256 ** $this->displacement) - 1;
+            $dispMask = 256 ** $this->displacement - 2;
             $dispShift = (8 * $this->displacement) - 1;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that 4624890 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] IncrementInteger
Address/ModRmAddress.php:62:13
         if ($this->displacement) {
             // This will generate the appropriate sized mask for the operation size.
             $dispMask = (256 ** $this->displacement) - 1;
-            $dispShift = (8 * $this->displacement) - 1;
+            $dispShift = 8 * $this->displacement - 2;
 
             // If the most significant bit is set, we have a 2's complement.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #2 (4634635, 127, 1, 0, 4634762)
Failed asserting that 4634506 matches expected 4634762.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Minus
Address/ModRmAddress.php:62:13
         if ($this->displacement) {
             // This will generate the appropriate sized mask for the operation size.
             $dispMask = (256 ** $this->displacement) - 1;
-            $dispShift = (8 * $this->displacement) - 1;
+            $dispShift = 8 * $this->displacement + 1;
 
             // If the most significant bit is set, we have a 2's complement.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that 4299592185 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] BitwiseAnd
Address/ModRmAddress.php:65:13
             $dispShift = (8 * $this->displacement) - 1;
 
             // If the most significant bit is set, we have a 2's complement.
-            if (($disp >> $dispShift) & 1) {
+            if ($disp >> $dispShift | 1) {
                 $disp = -(((~$disp) & $dispMask) + 1);
             }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #0 (4634635, 9746, 4, 0, 4644381)
Failed asserting that -4290322915 matches expected 4644381.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ShiftRight
Address/ModRmAddress.php:65:13
             $dispShift = (8 * $this->displacement) - 1;
 
             // If the most significant bit is set, we have a 2's complement.
-            if (($disp >> $dispShift) & 1) {
+            if ($disp << $dispShift & 1) {
                 $disp = -(((~$disp) & $dispMask) + 1);
             }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that 4299592185 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] DecrementInteger
Address/ModRmAddress.php:66:17
 
             // If the most significant bit is set, we have a 2's complement.
             if (($disp >> $dispShift) & 1) {
-                $disp = -(((~$disp) & $dispMask) + 1);
+                $disp = -((~$disp & $dispMask) + 0);
             }
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that 4624890 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] Plus
Address/ModRmAddress.php:66:17
 
             // If the most significant bit is set, we have a 2's complement.
             if (($disp >> $dispShift) & 1) {
-                $disp = -(((~$disp) & $dispMask) + 1);
+                $disp = -((~$disp & $dispMask) - 1);
             }
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #19 (4634635, 4294957550, 4, 0, 4624889)
Failed asserting that 4624891 matches expected 4624889.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 20, Assertions: 20, Failures: 1.

[Killed] Plus
Address/ModRmAddress.php:70:9
             }
         }
 
-        return $this->baseAddress + $disp + $offset;
+        return $this->baseAddress - $disp + $offset;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #0 (4634635, 9746, 4, 0, 4644381)
Failed asserting that 4624889 matches expected 4644381.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Plus
Address/ModRmAddress.php:70:9
             }
         }
 
-        return $this->baseAddress + $disp + $offset;
+        return $this->baseAddress + $disp - $offset;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\ModRmAddressTest::testModRmAddressResolvesCorrectly with data set #1 (634525, 242373, 4, 100, 876998)
Failed asserting that 876798 matches expected 876998.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/ModRmAddressTest.php:87

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
