[Killed] IncrementInteger
Address/RipAddress.php:59:9
         $address = $this->address;
 
         // If the most significant bit is set, we have a 2's complement.
-        if (($address >> 31) & 1) {
+        if ($address >> 32 & 1) {
             $address = -(((~$address) & 0xFFFFFFFF) + 1);
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #4 (0, 2147483657, 0, -2147483635)
Failed asserting that 2147483661 matches expected -2147483635.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Address/RipAddress.php:59:9
         $address = $this->address;
 
         // If the most significant bit is set, we have a 2's complement.
-        if (($address >> 31) & 1) {
+        if ($address >> 31 & 0) {
             $address = -(((~$address) & 0xFFFFFFFF) + 1);
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #4 (0, 2147483657, 0, -2147483635)
Failed asserting that 2147483661 matches expected -2147483635.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] IncrementInteger
Address/RipAddress.php:60:13
 
         // If the most significant bit is set, we have a 2's complement.
         if (($address >> 31) & 1) {
-            $address = -(((~$address) & 0xFFFFFFFF) + 1);
+            $address = -((~$address & 4294967296) + 1);
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #4 (0, 2147483657, 0, -2147483635)
Failed asserting that -4294967293 matches expected -2147483635.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Address/RipAddress.php:60:13
 
         // If the most significant bit is set, we have a 2's complement.
         if (($address >> 31) & 1) {
-            $address = -(((~$address) & 0xFFFFFFFF) + 1);
+            $address = -((~$address & 0xffffffff) + 0);
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #4 (0, 2147483657, 0, -2147483635)
Failed asserting that -2147483634 matches expected -2147483635.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] Plus
Address/RipAddress.php:65:9
 
         // Our RIP pointer is lagging behind, however it should be in front.
         // We will adjust that here.
-        return ($this->rip + $this->displacement) + $address + $offset;
+        return $this->rip - $this->displacement + $address + $offset;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #0 (100, 30, 0, 134)
Failed asserting that 126 matches expected 134.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Plus
Address/RipAddress.php:65:9
 
         // Our RIP pointer is lagging behind, however it should be in front.
         // We will adjust that here.
-        return ($this->rip + $this->displacement) + $address + $offset;
+        return $this->rip + $this->displacement - $address + $offset;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\RipAddressTest::testRipAddressResolvesCorrectly with data set #0 (100, 30, 0, 134)
Failed asserting that 74 matches expected 134.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/RipAddressTest.php:55

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
