[Killed] DecrementInteger
Address/SibAddress.php:49:9
      */
     public function __construct(array $sib, int $disp, int $sibSize)
     {
-        if (! in_array($sib['s'], [1, 2, 4, 8], true)) {
+        if (!in_array($sib['s'], [0, 2, 4, 8], true)) {
             $message = sprintf(
                 'Invalid SIB scale value %d. Expected 1, 2, 4 or 8.',
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testInvalidDisplacementThrowsException with data set #0 (-5)
Failed asserting that exception message 'Invalid SIB scale value 1. Expected 1, 2, 4 or 8.' contains 'Invalid SIB address length -5. Expected 1 (no displacement), 2 (8-bit displacement) or 5 (32-bit displacement).'.

ERRORS!
Tests: 97, Assertions: 74, Errors: 24, Failures: 1.

[Killed] DecrementInteger
Address/SibAddress.php:49:9
      */
     public function __construct(array $sib, int $disp, int $sibSize)
     {
-        if (! in_array($sib['s'], [1, 2, 4, 8], true)) {
+        if (!in_array($sib['s'], [1, 1, 4, 8], true)) {
             $message = sprintf(
                 'Invalid SIB scale value %d. Expected 1, 2, 4 or 8.',
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #14 (2, 345, 54532, 9203454, 5, 0, 9258676)
UnexpectedValueException: Invalid SIB scale value 2. Expected 1, 2, 4 or 8.

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:48
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:104

2) shan

[Killed] Throw_
Address/SibAddress.php:55:13
                 $sib['s'],
             );
 
-            throw new \UnexpectedValueException($message);
+            new \UnexpectedValueException($message);
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testInvalidScaleThrowsException with data set #0 (-5)
Failed asserting that exception of type "UnexpectedValueException" is thrown.

FAILURES!
Tests: 110, Assertions: 123, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:58:9
             throw new \UnexpectedValueException($message);
         }
 
-        if (! in_array($sibSize, [1, 2, 5], true)) {
+        if (!in_array($sibSize, [1, 2, 6], true)) {
             $message = sprintf(
                 'Invalid SIB address length %d. Expected 1 (no displacement), ' .
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testInvalidDisplacementThrowsException with data set #8 (6)
Failed asserting that exception of type "UnexpectedValueException" is thrown.

ERRORS!
Tests: 105, Assertions: 81, Errors: 32, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:58:9
             throw new \UnexpectedValueException($message);
         }
 
-        if (! in_array($sibSize, [1, 2, 5], true)) {
+        if (!in_array($sibSize, [2, 2, 5], true)) {
             $message = sprintf(
                 'Invalid SIB address length %d. Expected 1 (no displacement), ' .
killedBy: shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testImplements
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testImplements
UnexpectedValueException: Invalid SIB address length 1. Expected 1 (no displacement), 2 (8-bit displacement) or 5 (32-bit displacement).

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:52
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:20

2) shanept\AssemblySim

[Killed] ConcatOperandRemoval
Address/SibAddress.php:60:17
 
         if (! in_array($sibSize, [1, 2, 5], true)) {
             $message = sprintf(
-                'Invalid SIB address length %d. Expected 1 (no displacement), ' .
-                '2 (8-bit displacement) or 5 (32-bit displacement).',
+                $message = sprintf('2 (8-bit displacement) or 5 (32-bit displacement).', $sibSize);
                 $sibSize,
             );
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testInvalidDisplacementThrowsException with data set #0 (-5)
Failed asserting that exception message '2 (8-bit displacement) or 5 (32-bit displacement).' contains 'Invalid SIB address length -5. Expected 1 (no displacement), 2 (8-bit displacement) or 5 (32-bit displacement).'.

FAILURES!
Tests: 97, Assertions: 98, Failures: 1.

[Killed] ConcatOperandRemoval
Address/SibAddress.php:60:17
 
         if (! in_array($sibSize, [1, 2, 5], true)) {
             $message = sprintf(
-                'Invalid SIB address length %d. Expected 1 (no displacement), ' .
-                '2 (8-bit displacement) or 5 (32-bit displacement).',
+                $message = sprintf('Invalid SIB address length %d. Expected 1 (no displacement), ', $sibSize);
                 $sibSize,
             );
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testInvalidDisplacementThrowsException with data set #0 (-5)
Failed asserting that exception message 'Invalid SIB address length -5. Expected 1 (no displacement), ' contains 'Invalid SIB address length -5. Expected 1 (no displacement), 2 (8-bit displacement) or 5 (32-bit displacement).'.

FAILURES!
Tests: 97, Assertions: 98, Failures:

[Killed] Minus
Address/SibAddress.php:82:9
         $index = $this->sib['i'];
         $base = $this->sib['b'];
 
-        $dispSize = $this->sibSize - 1;
+        $dispSize = $this->sibSize + 1;
         $disp = $this->displacement;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4299747841 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:82:9
         $index = $this->sib['i'];
         $base = $this->sib['b'];
 
-        $dispSize = $this->sibSize - 1;
+        $dispSize = $this->sibSize - 2;
         $disp = $this->displacement;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #14 (2, 345, 54532, 9203454, 5, 0, 9258676)
Failed asserting that -7518540 matches expected 9258676.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

ERRORS!
Tests: 15, Assertions: 9, Errors: 6, Failures: 1.

[Killed] IfNegation
Address/SibAddress.php:86:9
         $disp = $this->displacement;
 
         // Handle two's compliment addresses.
-        if ($dispSize) {
-            // This will generate the appropriate sized mask for the operation size.
-            $dispMask = (256 ** $dispSize) - 1;
-            $dispShift = (8 * $dispSize) - 1;
-
-            // If the most significant bit is set, we have a 2's complement.
-            if (($disp >> $dispShift) & 1) {
-                $disp = -(((~$disp) & $dispMask) + 1);
-            }
-        }
+        if (!$dispSize) {
 
         $calculatedSib = ($scale * $index) + $base + $disp;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4299747841 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

ERRORS!
Tests: 29, Assertions: 17, Errors: 12, Failures: 1.

[Killed] Minus
Address/SibAddress.php:88:13
         // Handle two's compliment addresses.
         if ($dispSize) {
             // This will generate the appropriate sized mask for the operation size.
-            $dispMask = (256 ** $dispSize) - 1;
+            $dispMask = 256 ** $dispSize + 1;
             $dispShift = (8 * $dispSize) - 1;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that -4290177007 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:88:13
         // Handle two's compliment addresses.
         if ($dispSize) {
             // This will generate the appropriate sized mask for the operation size.
-            $dispMask = (256 ** $dispSize) - 1;
+            $dispMask = 256 ** $dispSize - 2;
             $dispShift = (8 * $dispSize) - 1;
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4780546 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:89:13
         if ($dispSize) {
             // This will generate the appropriate sized mask for the operation size.
             $dispMask = (256 ** $dispSize) - 1;
-            $dispShift = (8 * $dispSize) - 1;
+            $dispShift = 8 * $dispSize - 2;
 
             // If the most significant bit is set, we have a 2's complement.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #2 (8, 19457, 4634635, 127, 2, 0, 4790418)
Failed asserting that 4790162 matches expected 4790418.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] Minus
Address/SibAddress.php:89:13
         if ($dispSize) {
             // This will generate the appropriate sized mask for the operation size.
             $dispMask = (256 ** $dispSize) - 1;
-            $dispShift = (8 * $dispSize) - 1;
+            $dispShift = 8 * $dispSize + 1;
 
             // If the most significant bit is set, we have a 2's complement.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4299747841 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] IncrementInteger
Address/SibAddress.php:92:13
             $dispShift = (8 * $dispSize) - 1;
 
             // If the most significant bit is set, we have a 2's complement.
-            if (($disp >> $dispShift) & 1) {
+            if ($disp >> $dispShift & 2) {
                 $disp = -(((~$disp) & $dispMask) + 1);
             }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4299747841 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] BitwiseAnd
Address/SibAddress.php:93:17
 
             // If the most significant bit is set, we have a 2's complement.
             if (($disp >> $dispShift) & 1) {
-                $disp = -(((~$disp) & $dispMask) + 1);
+                $disp = -((~$disp | $dispMask) + 1);
             }
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #28 (8, 19457, 4634635, 4294957550, 5, 0, 4780545)
Failed asserting that 4790291 matches expected 4780545.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 29, Assertions: 29, Failures: 1.

[Killed] Multiplication
Address/SibAddress.php:97:9
             }
         }
 
-        $calculatedSib = ($scale * $index) + $base + $disp;
+        $calculatedSib = $scale / $index + $base + $disp;
 
         return $calculatedSib + $offset;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #0 (8, 19457, 4634635, 9746, 5, 0, 4800037)
TypeError: shanept\AssemblySimulator\Address\SibAddress::getAddress(): Return value must be of type int, float returned

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:79
/home/shane/Documents/code/AssemblySimulator/tests/

[Killed] Plus
Address/SibAddress.php:97:9
             }
         }
 
-        $calculatedSib = ($scale * $index) + $base + $disp;
+        $calculatedSib = $scale * $index - $base + $disp;
 
         return $calculatedSib + $offset;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #0 (8, 19457, 4634635, 9746, 5, 0, 4800037)
Failed asserting that -4469233 matches expected 4800037.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Plus
Address/SibAddress.php:99:9
 
         $calculatedSib = ($scale * $index) + $base + $disp;
 
-        return $calculatedSib + $offset;
+        return $calculatedSib - $offset;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Address\SibAddressTest::testSibAddressResolvesCorrectly with data set #6 (8, 525745, 634525, 0, 1, 5, 4840490)
Failed asserting that 4840480 matches expected 4840490.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Address/SibAddressTest.php:106

FAILURES!
Tests: 7, Assertions: 7, Failures: 1.
