[Killed] PublicVisibility
Instruction/AssemblyInstruction.php:56:5
      *
      * @param Simulator $simulator The simulator instance.
      */
-    public function setSimulator(Simulator $simulator): void
+    protected function setSimulator(Simulator $simulator): void
     {
         $this->simulator = $simulator;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testSetSimulatorAttemptsToRegisterInstruction
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testSetSimulatorAttemptsToRegisterInstruction
Error: Call to protected method shanept\AssemblySimulator\Instruction\AssemblyInstruction::setSimulator() from scope shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionT

[Killed] MethodCallRemoval
Instruction/AssemblyInstruction.php:59:9
     public function setSimulator(Simulator $simulator): void
     {
         $this->simulator = $simulator;
-        $simulator->registerInstructions($this, $this->register());
+        
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testSetSimulatorAttemptsToRegisterInstruction
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testSetSimulatorAttemptsToRegisterInstruction
Expectation failed for method name is "registerInstructions" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:65:5
     /**
      * Returns the simulator with which this AssemblyInstruction is registered.
      */
-    protected function getSimulator(): Simulator
+    private function getSimulator(): Simulator
     {
         return $this->simulator;

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:73:5
     /**
      * Determines the size of the operand to use for this instruction, in bits.
      */
-    protected function getOperandSize(): int
+    private function getOperandSize(): int
     {
         $maxWidth = $this->simulator->getLargestInstructionWidth();

[Killed] IfNegation
Instruction/AssemblyInstruction.php:85:9
          * On LONG and PROTECTED mode, 0x66 specifies 16-bit operations.
          * On REAL mode, 0x66 specifies 32-bit operations.
          */
-        if ($this->simulator->hasPrefix(0x66)) {
-            $size = Simulator::REAL_MODE === $mode ?
-                    Simulator::TYPE_DWRD :
-                    Simulator::TYPE_WORD;
-        }
+        if (!$this->simulator->hasPrefix(0x66)) {
 
         // If we are operating with REX_W, promote operation to 64-bits.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #8 (1, 'getOperandSize', 0, null, 16)
Failed asserting that 32 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:85:9
          * On LONG and PROTECTED mode, 0x66 specifies 16-bit operations.
          * On REAL mode, 0x66 specifies 32-bit operations.
          */
-        if ($this->simulator->hasPrefix(0x66)) {
+        if ($this->simulator->hasPrefix(103)) {
             $size = Simulator::REAL_MODE === $mode ?
                     Simulator::TYPE_DWRD :
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #12 (1, 'getOperandSize', 0, 102, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 13, Assertions: 13, Failures: 1.

[Killed] Ternary
Instruction/AssemblyInstruction.php:86:13
          * On REAL mode, 0x66 specifies 32-bit operations.
          */
         if ($this->simulator->hasPrefix(0x66)) {
-            $size = Simulator::REAL_MODE === $mode ?
-                    Simulator::TYPE_DWRD :
-                    Simulator::TYPE_WORD;
+            $size = (Simulator::REAL_MODE === $mode) ? Simulator::TYPE_WORD : Simulator::TYPE_DWRD;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #12 (1, 'getOperandSize', 0, 102, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 13, Assertions: 13, Failures: 1.

[Killed] Identical
Instruction/AssemblyInstruction.php:86:13
          * On REAL mode, 0x66 specifies 32-bit operations.
          */
         if ($this->simulator->hasPrefix(0x66)) {
-            $size = Simulator::REAL_MODE === $mode ?
+            $size = (Simulator::REAL_MODE !== $mode) ? Simulator::TYPE_DWRD : Simulator::TYPE_WORD;
                     Simulator::TYPE_DWRD :
                     Simulator::TYPE_WORD;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #12 (1, 'getOperandSize', 0, 102, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 13, Assertions: 13, Failures: 1.

[Killed] BitwiseAnd
Instruction/AssemblyInstruction.php:92:9
         }
 
         // If we are operating with REX_W, promote operation to 64-bits.
-        if ($rex & Simulator::REX_W) {
+        if ($rex | Simulator::REX_W) {
             $size = Simulator::TYPE_QUAD;
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #8 (1, 'getOperandSize', 0, null, 16)
Failed asserting that 64 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:102:5
     /**
      * Determines the size of the address to use for this instruction, in bits.
      */
-    protected function getAddressSize(): int
+    private function getAddressSize(): int
     {
         $maxWidth = $this->simulator->getLargestInstructionWidth();

[Killed] LogicalAndSingleSubExprNegation
Instruction/AssemblyInstruction.php:113:9
          * On x32, prefix 0x67 specifies a 16-bit address.
          * On 16-bit, prefix 0x67 specifies a 32-bit address.
          */
-        if ($this->simulator->hasPrefix(0x67) && Simulator::LONG_MODE !== $mode) {
+        if (!$this->simulator->hasPrefix(0x67) && Simulator::LONG_MODE !== $mode) {
             $maxWidth = Simulator::REAL_MODE === $mode ?
                             Simulator::TYPE_DWRD :
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #0 (1, 'getAddressSize', 0, null, 16)
Failed asserting that 32 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:113:9
          * On x32, prefix 0x67 specifies a 16-bit address.
          * On 16-bit, prefix 0x67 specifies a 32-bit address.
          */
-        if ($this->simulator->hasPrefix(0x67) && Simulator::LONG_MODE !== $mode) {
+        if ($this->simulator->hasPrefix(102) && Simulator::LONG_MODE !== $mode) {
             $maxWidth = Simulator::REAL_MODE === $mode ?
                             Simulator::TYPE_DWRD :
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #4 (1, 'getAddressSize', 0, 103, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] Identical
Instruction/AssemblyInstruction.php:114:13
          * On 16-bit, prefix 0x67 specifies a 32-bit address.
          */
         if ($this->simulator->hasPrefix(0x67) && Simulator::LONG_MODE !== $mode) {
-            $maxWidth = Simulator::REAL_MODE === $mode ?
+            $maxWidth = (Simulator::REAL_MODE !== $mode) ? Simulator::TYPE_DWRD : Simulator::TYPE_WORD;
                             Simulator::TYPE_DWRD :
                             Simulator::TYPE_WORD;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #4 (1, 'getAddressSize', 0, 103, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Killed] Ternary
Instruction/AssemblyInstruction.php:114:13
          * On 16-bit, prefix 0x67 specifies a 32-bit address.
          */
         if ($this->simulator->hasPrefix(0x67) && Simulator::LONG_MODE !== $mode) {
-            $maxWidth = Simulator::REAL_MODE === $mode ?
-                            Simulator::TYPE_DWRD :
-                            Simulator::TYPE_WORD;
+            $maxWidth = (Simulator::REAL_MODE === $mode) ? Simulator::TYPE_WORD : Simulator::TYPE_DWRD;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetAddressOrOperandSize with data set #4 (1, 'getAddressSize', 0, 103, 32)
Failed asserting that 16 matches expected 32.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:124

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:131:5
      *
      * @return int[] The two registers codes.
      */
-    protected function parseModRmByte(string $byte): array
+    private function parseModRmByte(string $byte): array
     {
         $byte = ord($byte);

[Killed] ArrayItemRemoval
Instruction/AssemblyInstruction.php:135:9
     {
         $byte = ord($byte);
 
-        return [
-            "mod" => ($byte & 0b11000000) >> 6,
-            "reg" => ($byte & 0b00111000) >> 3,
-            "rm" => $byte & 0b00000111,
-        ];
+        return ["reg" => ($byte & 0b111000) >> 3, "rm" => $byte & 0b111];
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #0 (Binary String: 0x00, 0, 0, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:136:13
         $byte = ord($byte);
 
         return [
-            "mod" => ($byte & 0b11000000) >> 6,
+            return ["mod" => ($byte & 191) >> 6, "reg" => ($byte & 0b111000) >> 3, "rm" => $byte & 0b111];
             "reg" => ($byte & 0b00111000) >> 3,
             "rm" => $byte & 0b00000111,
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #64 ('@', 1, 0, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:136:13
         $byte = ord($byte);
 
         return [
-            "mod" => ($byte & 0b11000000) >> 6,
+            return ["mod" => ($byte & 0b11000000) >> 7, "reg" => ($byte & 0b111000) >> 3, "rm" => $byte & 0b111];
             "reg" => ($byte & 0b00111000) >> 3,
             "rm" => $byte & 0b00000111,
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #64 ('@', 1, 0, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:137:13
 
         return [
             "mod" => ($byte & 0b11000000) >> 6,
-            "reg" => ($byte & 0b00111000) >> 3,
+            return ["mod" => ($byte & 0b11000000) >> 6, "reg" => ($byte & 0b111000) >> 2, "rm" => $byte & 0b111];
             "rm" => $byte & 0b00000111,
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #1 (Binary String: 0x10, 0, 2, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] ShiftRight
Instruction/AssemblyInstruction.php:137:13
 
         return [
             "mod" => ($byte & 0b11000000) >> 6,
-            "reg" => ($byte & 0b00111000) >> 3,
+            return ["mod" => ($byte & 0b11000000) >> 6, "reg" => ($byte & 0b111000) << 3, "rm" => $byte & 0b111];
             "rm" => $byte & 0b00000111,
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #1 (Binary String: 0x10, 0, 2, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] BitwiseAnd
Instruction/AssemblyInstruction.php:138:13
         return [
             "mod" => ($byte & 0b11000000) >> 6,
             "reg" => ($byte & 0b00111000) >> 3,
-            "rm" => $byte & 0b00000111,
+            return ["mod" => ($byte & 0b11000000) >> 6, "reg" => ($byte & 0b111000) >> 3, "rm" => $byte | 0b111];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #0 (Binary String: 0x00, 0, 0, 0)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:138:13
         return [
             "mod" => ($byte & 0b11000000) >> 6,
             "reg" => ($byte & 0b00111000) >> 3,
-            "rm" => $byte & 0b00000111,
+            return ["mod" => ($byte & 0b11000000) >> 6, "reg" => ($byte & 0b111000) >> 3, "rm" => $byte & 6];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseModRmByte with data set #4 (Binary String: 0x01, 0, 0, 1)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     0 => 0
     1 => 0

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:157:13
     {
         $byte = ord($byte);
         $sib = [
-            's' => ($byte & 0b11000000) >> 6,
+            $sib = ['s' => ($byte & 0b11000000) >> 5, 'i' => ($byte & 0b111000) >> 3, 'b' => $byte & 0b111];
             'i' => ($byte & 0b00111000) >> 3,
             'b' => $byte & 0b00000111,
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #3 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 2, 0, 4, 'E', Binary String: 0x30102040, 1075843642)
Failed asserting that 1075843666 matches expected 1075843642.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest

[Killed] ShiftRight
Instruction/AssemblyInstruction.php:157:13
     {
         $byte = ord($byte);
         $sib = [
-            's' => ($byte & 0b11000000) >> 6,
+            $sib = ['s' => ($byte & 0b11000000) << 6, 'i' => ($byte & 0b111000) >> 3, 'b' => $byte & 0b111];
             'i' => ($byte & 0b00111000) >> 3,
             'b' => $byte & 0b00000111,
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
UnexpectedValueException: Invalid SIB scale value 0. Expected 1, 2, 4 or 8.

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:55
/home/shane/Documents/cod

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:158:13
         $byte = ord($byte);
         $sib = [
             's' => ($byte & 0b11000000) >> 6,
-            'i' => ($byte & 0b00111000) >> 3,
+            $sib = ['s' => ($byte & 0b11000000) >> 6, 'i' => ($byte & 0b111000) >> 2, 'b' => $byte & 0b111];
             'b' => $byte & 0b00000111,
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Incorrect register %esi

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:553
/home/shane/Documents/code/AssemblySimulator/src/Ins

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:158:13
         $byte = ord($byte);
         $sib = [
             's' => ($byte & 0b11000000) >> 6,
-            'i' => ($byte & 0b00111000) >> 3,
+            $sib = ['s' => ($byte & 0b11000000) >> 6, 'i' => ($byte & 55) >> 3, 'b' => $byte & 0b111];
             'b' => $byte & 0b00000111,
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Incorrect register %edx

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:553
/home/shane/Documents/code/AssemblySimulator/src/Ins

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:159:13
         $sib = [
             's' => ($byte & 0b11000000) >> 6,
             'i' => ($byte & 0b00111000) >> 3,
-            'b' => $byte & 0b00000111,
+            $sib = ['s' => ($byte & 0b11000000) >> 6, 'i' => ($byte & 0b111000) >> 3, 'b' => $byte & 6];
         ];
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Incorrect register %esp

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:553
/home/shane/Documents/code/AssemblySimulator/src/Instructi

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:159:13
         $sib = [
             's' => ($byte & 0b11000000) >> 6,
             'i' => ($byte & 0b00111000) >> 3,
-            'b' => $byte & 0b00000111,
+            $sib = ['s' => ($byte & 0b11000000) >> 6, 'i' => ($byte & 0b111000) >> 3, 'b' => $byte & 8];
         ];
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Failed asserting that 109 matches expected 595.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

ERRORS!
Tests: 282, Assertions: 3

[Killed] CastBool
Instruction/AssemblyInstruction.php:166:9
         $addrSize = $this->getAddressSize();
 
         $rex = $this->simulator->getRex();
-        $rexSet = (bool) ($rex & Simulator::REX);
+        $rexSet = $rex & Simulator::REX;
         $idxExt = (bool) ($rex & Simulator::REX_X);
         $bseExt = (bool) ($rex & Simulator::REX_B);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #3 ($rexSet) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Ins

[Survived] BitwiseAnd
Instruction/AssemblyInstruction.php:166:9
         $addrSize = $this->getAddressSize();
 
         $rex = $this->simulator->getRex();
-        $rexSet = (bool) ($rex & Simulator::REX);
+        $rexSet = (bool) ($rex | Simulator::REX);
         $idxExt = (bool) ($rex & Simulator::REX_X);
         $bseExt = (bool) ($rex & Simulator::REX_B);

[Killed] CastBool
Instruction/AssemblyInstruction.php:167:9
 
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $idxExt = (bool) ($rex & Simulator::REX_X);
+        $idxExt = $rex & Simulator::REX_X;
         $bseExt = (bool) ($rex & Simulator::REX_B);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/In

[Survived] BitwiseAnd
Instruction/AssemblyInstruction.php:167:9
 
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $idxExt = (bool) ($rex & Simulator::REX_X);
+        $idxExt = (bool) ($rex | Simulator::REX_X);
         $bseExt = (bool) ($rex & Simulator::REX_B);
 

[Killed] BitwiseAnd
Instruction/AssemblyInstruction.php:168:9
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
         $idxExt = (bool) ($rex & Simulator::REX_X);
-        $bseExt = (bool) ($rex & Simulator::REX_B);
+        $bseExt = (bool) ($rex | Simulator::REX_B);
 
         /**
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #1 (3, 74, [12, 4, '%r12', 64, 9223372036854775807], 428, [0, 0, '%rax', 64, 9223372036854775807], 54925, 0, 1, 4, '?', null, 56637)
Incorrect register %r8

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:553
/home/shane/Documents/code/Assemb

[Killed] CastBool
Instruction/AssemblyInstruction.php:168:9
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
         $idxExt = (bool) ($rex & Simulator::REX_X);
-        $bseExt = (bool) ($rex & Simulator::REX_B);
+        $bseExt = $rex & Simulator::REX_B;
 
         /**
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/In

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:178:9
          * If scale bit == 0b10, scale is 4.
          * If scale bit == 0b11, scale is 8.
          */
-        $scale = 2 ** $sib['s'];
+        $scale = 3 ** $sib['s'];
 
         /**
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
UnexpectedValueException: Invalid SIB scale value 9. Expected 1, 2, 4 or 8.

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:55
/home/shane/Documents/cod

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:178:9
          * If scale bit == 0b10, scale is 4.
          * If scale bit == 0b11, scale is 8.
          */
-        $scale = 2 ** $sib['s'];
+        $scale = 1 ** $sib['s'];
 
         /**
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Failed asserting that 55349 matches expected 56627.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

FAILURES!
Tests: 280, A

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:189:9
          * making the index scale to 0 as well. If the REX.X bit is set, the
          * above no longer applies.
          */
-        $index = 0;
+        $index = -1;
 
         if (0x4 !== $sib['i'] || $idxExt) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Failed asserting that 39 matches expected 40.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:628

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalOrSingleSubExprNegation
Instruction/AssemblyInstruction.php:191:9
          */
         $index = 0;
 
-        if (0x4 !== $sib['i'] || $idxExt) {
+        if (0x4 !== $sib['i'] || !$idxExt) {
             $reg = Register::getByCode($sib['i'], $addrSize, $rexSet, $idxExt);
             $index = $this->simulator->readRegister($reg);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #1 (3, 74, [12, 4, '%r12', 64, 9223372036854775807], 428, [0, 0, '%rax', 64, 9223372036854775807], 54925, 0, 1, 4, '?', null, 56637)
Failed asserting that 54925 matches expected 56637.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

FAI

[Killed] NotIdentical
Instruction/AssemblyInstruction.php:191:9
          */
         $index = 0;
 
-        if (0x4 !== $sib['i'] || $idxExt) {
+        if (0x4 === $sib['i'] || $idxExt) {
             $reg = Register::getByCode($sib['i'], $addrSize, $rexSet, $idxExt);
             $index = $this->simulator->readRegister($reg);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Failed asserting that 54923 matches expected 56627.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

FAILURES!
Tests: 280, A

[Killed] LogicalAnd
Instruction/AssemblyInstruction.php:204:13
          * @see http://www.c-jump.com/CIS77/CPU/x86/X77_0090_addressing_modes.htm
          */
         if (
-            0x5 === $sib['b'] &&
-            0b00 === $modrm['mod'] &&
+            if ((0x5 === $sib['b'] || 0b0 === $modrm['mod']) && Simulator::REAL_MODE !== $mode) {'] &&
             Simulator::REAL_MODE !== $mode
         ) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(3, 4): string does

[Killed] Identical
Instruction/AssemblyInstruction.php:204:13
          * @see http://www.c-jump.com/CIS77/CPU/x86/X77_0090_addressing_modes.htm
          */
         if (
-            0x5 === $sib['b'] &&
+            if (0x5 !== $sib['b'] && 0b0 === $modrm['mod'] && Simulator::REAL_MODE !== $mode) {
             0b00 === $modrm['mod'] &&
             Simulator::REAL_MODE !== $mode
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Failed asserting that 0 matches expected 40.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:628

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:205:13
          */
         if (
             0x5 === $sib['b'] &&
-            0b00 === $modrm['mod'] &&
+            if (0x5 === $sib['b'] && -1 === $modrm['mod'] && Simulator::REAL_MODE !== $mode) {
             Simulator::REAL_MODE !== $mode
         ) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Failed asserting that 0 matches expected 40.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:628

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Identical
Instruction/AssemblyInstruction.php:205:13
          */
         if (
             0x5 === $sib['b'] &&
-            0b00 === $modrm['mod'] &&
+            if (0x5 === $sib['b'] && 0b0 !== $modrm['mod'] && Simulator::REAL_MODE !== $mode) {
             Simulator::REAL_MODE !== $mode
         ) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(3, 4): string does
