[Killed] NotIdentical
Instruction/AssemblyInstruction.php:206:13
         if (
             0x5 === $sib['b'] &&
             0b00 === $modrm['mod'] &&
-            Simulator::REAL_MODE !== $mode
+            if (0x5 === $sib['b'] && 0b0 === $modrm['mod'] && Simulator::REAL_MODE === $mode) {
         ) {
             // Override displacement, no base (disp32 only).
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Failed asserting that 0 matches expected 40.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:628

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:209:13
             Simulator::REAL_MODE !== $mode
         ) {
             // Override displacement, no base (disp32 only).
-            $base = 0;
+            $base = -1;
             $displacement = 4;
         } else {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Failed asserting that 39 matches expected 40.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:628

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:210:13
         ) {
             // Override displacement, no base (disp32 only).
             $base = 0;
-            $displacement = 4;
+            $displacement = 3;
         } else {
             $displacement = (0b10 === $modrm['mod'] ? 4 : $modrm['mod']);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Expectation failed for method name is "getCodeBuffer" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(4, 3): string does not match expected value.
Failed asserting that 3 matches expected 4.

/home/shane/Documents/code/As

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:210:13
         ) {
             // Override displacement, no base (disp32 only).
             $base = 0;
-            $displacement = 4;
+            $displacement = 5;
         } else {
             $displacement = (0b10 === $modrm['mod'] ? 4 : $modrm['mod']);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
Expectation failed for method name is "getCodeBuffer" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(4, 5): string does not match expected value.
Failed asserting that 5 matches expected 4.

/home/shane/Documents/code/As

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:212:13
             $base = 0;
             $displacement = 4;
         } else {
-            $displacement = (0b10 === $modrm['mod'] ? 4 : $modrm['mod']);
+            $displacement = (1 === $modrm['mod']) ? 4 : $modrm['mod'];
             $reg = Register::getByCode($sib['b'], $addrSize, $rexSet, $bseExt);
             $base = $this->simulator->readRegister($reg);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(3, 4): string does

[Killed] Ternary
Instruction/AssemblyInstruction.php:212:13
             $base = 0;
             $displacement = 4;
         } else {
-            $displacement = (0b10 === $modrm['mod'] ? 4 : $modrm['mod']);
+            $displacement = (0b10 === $modrm['mod']) ? $modrm['mod'] : 4;
             $reg = Register::getByCode($sib['b'], $addrSize, $rexSet, $bseExt);
             $base = $this->simulator->readRegister($reg);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(3, 4): string does

[Killed] ArrayItemRemoval
Instruction/AssemblyInstruction.php:217:9
             $base = $this->simulator->readRegister($reg);
         }
 
-        return [
-            's' => $scale,
-            'i' => $index,
-            'b' => $base,
-            'displacement' => $displacement,
-        ];
+        return ['i' => $index, 'b' => $base, 'displacement' => $displacement];
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
UnexpectedValueException: Invalid SIB scale value 0. Expected 1, 2, 4 or 8.

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:55
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:247
/home/shane/Documents/code/Ass

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:232:5
      * @param string $immediate The binary encoded number in string format.
      * @param int    $size      The bit-width of the $immediate (8, 16, 32, 64).
      */
-    protected function unpackImmediate(string $immediate, int $size): int
+    private function unpackImmediate(string $immediate, int $size): int
     {
         $result = @unpack(self::IMM_PACK_FMT[$size], $immediate);

[Killed] IfNegation
Instruction/AssemblyInstruction.php:236:9
     {
         $result = @unpack(self::IMM_PACK_FMT[$size], $immediate);
 
-        if (is_array($result)) {
-            return $result['imm'];
-        }
+        if (!is_array($result)) {
 
         $message = sprintf(
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testUnpackThrowsExceptionOnInvalidImmediateForSize
Failed asserting that exception of type "TypeError" matches expected exception "UnexpectedValueException". Message was: "shanept\AssemblySimulator\Instruction\AssemblyInstruction::unpackImmediate(): Return value must be of type int, null returned" at
/home/shane/Documents/

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:258:5
      *
      * @return string The binary encoded immediate.
      */
-    protected function packImmediate(int $immediate, int $size): string
+    private function packImmediate(int $immediate, int $size): string
     {
         return pack(self::IMM_PACK_FMT[$size][0], $immediate);

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:260:9
      */
     protected function packImmediate(int $immediate, int $size): string
     {
-        return pack(self::IMM_PACK_FMT[$size][0], $immediate);
+        return pack(self::IMM_PACK_FMT[$size][1], $immediate);
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testPackImmediate with data set #0 (8, '2', 50)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'2'
+Binary String: 0x32000000

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:270:5
      *
      * @return AddressInterface An addressing mode resolver.
      */
-    protected function parseAddress(array $byte): AddressInterface
+    private function parseAddress(array $byte): AddressInterface
     {
         $isLong = Simulator::LONG_MODE === $this->simulator->getMode();

[Killed] Identical
Instruction/AssemblyInstruction.php:272:9
      */
     protected function parseAddress(array $byte): AddressInterface
     {
-        $isLong = Simulator::LONG_MODE === $this->simulator->getMode();
+        $isLong = Simulator::LONG_MODE !== $this->simulator->getMode();
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
UnexpectedValueException: Invalid binary-encoded immediate value 0x specified for size 32.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:187
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:295
/home/shan

[Killed] Identical
Instruction/AssemblyInstruction.php:280:9
          * Otherwise the address is in the register referenced by r/m,
          * offset determined by mod.
          */
-        if (0x4 === $byte['rm']) {
+        if (0x4 !== $byte['rm']) {
             return $this->parseSibAddress($byte);
         } elseif (0x5 === $byte['rm'] && 0 === $byte['mod'] && $isLong) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #0 (3, 0, null, [3, 3, '%ebx', 32, 4294967295], 849, Binary String: 0x10, 1, 0, 3, 865)
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([...]): int does not m

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:280:9
          * Otherwise the address is in the register referenced by r/m,
          * offset determined by mod.
          */
-        if (0x4 === $byte['rm']) {
+        if (5 === $byte['rm']) {
             return $this->parseSibAddress($byte);
         } elseif (0x5 === $byte['rm'] && 0 === $byte['mod'] && $isLong) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnModRmDisp32AddressInProtectedMode with data set #0 (1, [5, 5, '%bp', 16, 65535])
shanept\AssemblySimulator\Simulator::readRegister([...]): int was not expected to be called.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:153
/home/shane/Documents/code/AssemblySimulat

[Killed] LogicalAndAllSubExprNegation
Instruction/AssemblyInstruction.php:282:9
          */
         if (0x4 === $byte['rm']) {
             return $this->parseSibAddress($byte);
-        } elseif (0x5 === $byte['rm'] && 0 === $byte['mod'] && $isLong) {
+        } elseif (!(0x5 === $byte['rm']) && !(0 === $byte['mod']) && !$isLong) {
             return $this->parseRipAddress($byte);
         } else {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
UnexpectedValueException: Invalid binary-encoded immediate value 0x specified for size 32.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:187
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:295
/home/shan

[Killed] LogicalAnd
Instruction/AssemblyInstruction.php:282:9
          */
         if (0x4 === $byte['rm']) {
             return $this->parseSibAddress($byte);
-        } elseif (0x5 === $byte['rm'] && 0 === $byte['mod'] && $isLong) {
+        } elseif ((0x5 === $byte['rm'] || 0 === $byte['mod']) && $isLong) {
             return $this->parseRipAddress($byte);
         } else {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressDoesNotUseRipOnModRmMod1
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressDoesNotUseRipOnModRmMod1
UnexpectedValueException: Invalid binary-encoded immediate value 0x specified for size 32.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:187
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:260
/home/shane/D

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:300:9
     {
         $sim = $this->simulator;
 
-        $sibByte = $sim->getCodeAtInstruction(1);
+        $sibByte = $sim->getCodeAtInstruction(0);
         $sib = $this->parseSibByte($sibByte, $byte);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:300:9
     {
         $sim = $this->simulator;
 
-        $sibByte = $sim->getCodeAtInstruction(1);
+        $sibByte = $sim->getCodeAtInstruction(2);
         $sib = $this->parseSibByte($sibByte, $byte);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction

[Killed] IfNegation
Instruction/AssemblyInstruction.php:306:9
         $dispSize = $sib['displacement'];
         $instructionPointer = $sim->getInstructionPointer();
 
-        if ($dispSize) {
-            $dispOffset = $instructionPointer + 1;
-            $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
-        } else {
-            $displacement = 0;
-        }
+        if (!$dispSize) {
 
         $address = new SibAddress(
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Failed asserting that 546 matches expected 595.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

ERRORS!
Tests: 282, Assertions: 2

[Killed] Plus
Instruction/AssemblyInstruction.php:307:13
         $instructionPointer = $sim->getInstructionPointer();
 
         if ($dispSize) {
-            $dispOffset = $instructionPointer + 1;
+            $dispOffset = $instructionPointer - 1;
             $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
             $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(1, 1): string does

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:307:13
         $instructionPointer = $sim->getInstructionPointer();
 
         if ($dispSize) {
-            $dispOffset = $instructionPointer + 1;
+            $dispOffset = $instructionPointer + 0;
             $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
             $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #2 (2, 0, [0, 0, '%eax', 32, 4294967295], 12, [5, 5, '%ebp', 32, 4294967295], 498, 1, 0, 4, '?', '1', 595)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(2, 1): string does

[Killed] Multiplication
Instruction/AssemblyInstruction.php:309:13
         if ($dispSize) {
             $dispOffset = $instructionPointer + 1;
             $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
+            $displacement = $this->unpackImmediate($displacement, $dispSize / 8);
         } else {
             $displacement = 0;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
TypeError: shanept\AssemblySimulator\Instruction\AssemblyInstruction::unpackImmediate(): Argument #2 ($size) must be of type int, float given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php on line 243

/home/shane/Document

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:309:13
         if ($dispSize) {
             $dispOffset = $instructionPointer + 1;
             $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
+            $displacement = $this->unpackImmediate($displacement, $dispSize * 7);
         } else {
             $displacement = 0;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:182
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:243
/home/shane/Do

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:311:13
             $displacement = $sim->getCodeBuffer($dispOffset, $dispSize);
             $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
         } else {
-            $displacement = 0;
+            $displacement = -1;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Failed asserting that 56626 matches expected 56627.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:582

FAILURES!
Tests: 280, A

[Killed] Plus
Instruction/AssemblyInstruction.php:317:13
         $address = new SibAddress(
             $sib,
             $displacement,
-            $dispSize + 1,
+            $address = new SibAddress($sib, $displacement, $dispSize - 1);
         );
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressWithSibDisp32OverrideInProtectedMode
UnexpectedValueException: Invalid SIB address length 3. Expected 1 (no displacement), 2 (8-bit displacement) or 5 (32-bit displacement).

/home/shane/Documents/code/AssemblySimulator/src/Address/SibAddress.php:65
/home/shane/Documents/code/AssemblySimulator/src/Instructi

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:317:13
         $address = new SibAddress(
             $sib,
             $displacement,
-            $dispSize + 1,
+            $address = new SibAddress($sib, $displacement, $dispSize + 2);
         );
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseSibAddress with data set #0 (2, 0, [3, 3, '%ebx', 32, 4294967295], 426, [0, 0, '%eax', 32, 4294967295], 54923, 0, 1, 4, '?', null, 56627)
Failed asserting that 2 matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:583

FAILURES!
Tests: 280, Assertion

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:332:9
      */
     private function parseRipAddress(array $byte): RipAddress
     {
-        $address = $this->simulator->getCodeAtInstruction(4);
+        $address = $this->simulator->getCodeAtInstruction(3);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(3): string does not match expected value.
Failed asserting that 3 matches expected 4.

/home/shane/Doc

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:332:9
      */
     private function parseRipAddress(array $byte): RipAddress
     {
-        $address = $this->simulator->getCodeAtInstruction(4);
+        $address = $this->simulator->getCodeAtInstruction(5);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(5): string does not match expected value.
Failed asserting that 5 matches expected 4.

/home/shane/Doc

[Killed] PlusEqual
Instruction/AssemblyInstruction.php:336:9
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
         $instructionPointer = $this->simulator->getInstructionPointer();
-        $instructionPointer += $this->simulator->getAddressBase();
+        $instructionPointer -= $this->simulator->getAddressBase();
 
         return new RipAddress($instructionPointer, $address);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
Failed asserting that -1030538848283 matches expected 1031045453797.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:403

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Assignment
Instruction/AssemblyInstruction.php:336:9
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
         $instructionPointer = $this->simulator->getInstructionPointer();
-        $instructionPointer += $this->simulator->getAddressBase();
+        $instructionPointer = $this->simulator->getAddressBase();
 
         return new RipAddress($instructionPointer, $address);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressAcceptsRipAddressOnLongMode
Failed asserting that 1031045453796 matches expected 1031045453797.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:403

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] BitwiseAnd
Instruction/AssemblyInstruction.php:352:9
     {
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $bseExt = (bool) ($rex & Simulator::REX_B);
+        $bseExt = (bool) ($rex | Simulator::REX_B);
 
         $opSize = $this->getOperandSize();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #4 (1, 72, 102, [3, 3, '%rbx', 64, 9223372036854775807], 277938170, Binary String: 0x10, 1, 0, 3, 277938186)
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([

[Killed] CastBool
Instruction/AssemblyInstruction.php:352:9
     {
         $rex = $this->simulator->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $bseExt = (bool) ($rex & Simulator::REX_B);
+        $bseExt = $rex & Simulator::REX_B;
 
         $opSize = $this->getOperandSize();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressDoesNotUseRipOnModRmMod1
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressDoesNotUseRipOnModRmMod1
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php on line 289

/home/shane/Documents/code/AssemblySimulator/src/Register.p

[Survived] DecrementInteger
Instruction/AssemblyInstruction.php:355:9
         $bseExt = (bool) ($rex & Simulator::REX_B);
 
         $opSize = $this->getOperandSize();
-        $displacement = 0;
+        $displacement = -1;
 
         /**

[Killed] LogicalAndAllSubExprNegation
Instruction/AssemblyInstruction.php:362:9
          * RIP relative address with 32-bit displacement. On a 32-bit machine,
          * we just have a near with 32-bit displacement.
          */
-        if (0x5 === $byte['rm'] && 0x0 === $byte['mod']) {
+        if (!(0x5 === $byte['rm']) && !(0x0 === $byte['mod'])) {
             $dispSize = 4;
             $address = 0;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #0 (3, 0, null, [3, 3, '%ebx', 32, 4294967295], 849, Binary String: 0x10, 1, 0, 3, 865)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(1, 4): string does n

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:362:9
          * RIP relative address with 32-bit displacement. On a 32-bit machine,
          * we just have a near with 32-bit displacement.
          */
-        if (0x5 === $byte['rm'] && 0x0 === $byte['mod']) {
+        if (4 === $byte['rm'] && 0x0 === $byte['mod']) {
             $dispSize = 4;
             $address = 0;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnModRmDisp32AddressInProtectedMode with data set #0 (1, [5, 5, '%bp', 16, 65535])
shanept\AssemblySimulator\Simulator::readRegister([...]): int was not expected to be called.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:290
/home/shane/Documents/code/AssemblySimulat

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:363:13
          * we just have a near with 32-bit displacement.
          */
         if (0x5 === $byte['rm'] && 0x0 === $byte['mod']) {
-            $dispSize = 4;
+            $dispSize = 3;
             $address = 0;
         } else {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnModRmDisp32AddressInProtectedMode with data set #0 (1, [5, 5, '%bp', 16, 65535])
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(2, 3): string does not match expected value.
Failed asserting

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:363:13
          * we just have a near with 32-bit displacement.
          */
         if (0x5 === $byte['rm'] && 0x0 === $byte['mod']) {
-            $dispSize = 4;
+            $dispSize = 5;
             $address = 0;
         } else {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnModRmDisp32AddressInProtectedMode with data set #0 (1, [5, 5, '%bp', 16, 65535])
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(2, 5): string does not match expected value.
Failed asserting
