[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:364:13
          */
         if (0x5 === $byte['rm'] && 0x0 === $byte['mod']) {
             $dispSize = 4;
-            $address = 0;
+            $address = -1;
         } else {
             $dispSize = 2 == $byte["mod"] ? 4 : $byte["mod"];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnModRmDisp32AddressInProtectedMode with data set #0 (1, [5, 5, '%bp', 16, 65535])
Failed asserting that 275917439 matches expected 275917440.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:366

FAILURES!
Tests: 278, Assertions: 289, Failures: 1.

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:366:13
             $dispSize = 4;
             $address = 0;
         } else {
-            $dispSize = 2 == $byte["mod"] ? 4 : $byte["mod"];
+            $dispSize = (2 == $byte["mod"]) ? 3 : $byte["mod"];
 
             $reg = Register::getByCode($byte['rm'], $opSize, $rexSet, $bseExt);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #1 (2, 0, null, [3, 3, '%ebx', 32, 4294967295], 849, Binary String: 0x10000000, 2, 0, 3, 865)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(1, 3): string

[Killed] Equal
Instruction/AssemblyInstruction.php:366:13
             $dispSize = 4;
             $address = 0;
         } else {
-            $dispSize = 2 == $byte["mod"] ? 4 : $byte["mod"];
+            $dispSize = (2 != $byte["mod"]) ? 4 : $byte["mod"];
 
             $reg = Register::getByCode($byte['rm'], $opSize, $rexSet, $bseExt);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #0 (3, 0, null, [3, 3, '%ebx', 32, 4294967295], 849, Binary String: 0x10, 1, 0, 3, 865)
Expectation failed for method name is "getCodeBuffer" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::getCodeBuffer(1, 4): string does n

[Killed] IfNegation
Instruction/AssemblyInstruction.php:372:9
             $address = $this->simulator->readRegister($reg);
         }
 
-        if ($dispSize) {
-            $dispOffset = $this->simulator->getInstructionPointer();
-            $displacement = $this->simulator->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
-        }
+        if (!$dispSize) {
 
         return new ModRmAddress($address, $displacement, $dispSize);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressOnMemoryOffsetAddress with data set #0 (3, 0, null, [3, 3, '%ebx', 32, 4294967295], 849, Binary String: 0x10, 1, 0, 3, 865)
Failed asserting that 849 matches expected 865.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/AssemblyInstructionTest.php:306

FAILURES!
Tests: 273, Assertions:

[Killed] Multiplication
Instruction/AssemblyInstruction.php:375:13
         if ($dispSize) {
             $dispOffset = $this->simulator->getInstructionPointer();
             $displacement = $this->simulator->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
+            $displacement = $this->unpackImmediate($displacement, $dispSize / 8);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressLooksLikeRipOnProtectedModeReturnsModRmAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressLooksLikeRipOnProtectedModeReturnsModRmAddress
TypeError: shanept\AssemblySimulator\Instruction\AssemblyInstruction::unpackImmediate(): Argument #2 ($size) must be of type int, float given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php on line 295

/home/shan

[Killed] DecrementInteger
Instruction/AssemblyInstruction.php:375:13
         if ($dispSize) {
             $dispOffset = $this->simulator->getInstructionPointer();
             $displacement = $this->simulator->getCodeBuffer($dispOffset, $dispSize);
-            $displacement = $this->unpackImmediate($displacement, $dispSize * 8);
+            $displacement = $this->unpackImmediate($displacement, $dispSize * 7);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressLooksLikeRipOnProtectedModeReturnsModRmAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testParseAddressLooksLikeRipOnProtectedModeReturnsModRmAddress
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:182
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:295
/hom

[Survived] ProtectedVisibility
Instruction/AssemblyInstruction.php:386:5
      *
      * @return RegisterObj The Register for the stack.
      */
-    protected function getStackPointerRegister(): array
+    private function getStackPointerRegister(): array
     {
         static $pointers = [

[Killed] IncrementInteger
Instruction/AssemblyInstruction.php:394:9
             Register::RSP,
         ];
 
-        return $pointers[$this->simulator->getMode() - 1];
+        return $pointers[$this->simulator->getMode() - 2];
     }
 }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetStackPointer with data set #1 (2, [4, 4, '%esp', 32, 4294967295])
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'offset' => 4
     'code' => 4

[Killed] Minus
Instruction/AssemblyInstruction.php:394:9
             Register::RSP,
         ];
 
-        return $pointers[$this->simulator->getMode() - 1];
+        return $pointers[$this->simulator->getMode() + 1];
     }
 }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\AssemblyInstructionTest::testGetStackPointer with data set #0 (1, [4, 4, '%sp', 16, 65535])
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'offset' => 4
     'code' => 4
