[Killed] LogicalAndAllSubExprNegation
Instruction/Call.php:40:9
      */
     public function __construct($onAddress = null)
     {
-        if (! is_null($onAddress) && ! is_callable($onAddress)) {
+        if (is_null($onAddress) && is_callable($onAddress)) {
             $message = sprintf(
                 'Expected a callable or null, "%s" received.',
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallThrowsExceptionOnInvalidCallback
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallThrowsExceptionOnInvalidCallback
Failed asserting that exception of type "LogicException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalAndNegation
Instruction/Call.php:40:9
      */
     public function __construct($onAddress = null)
     {
-        if (! is_null($onAddress) && ! is_callable($onAddress)) {
+        if (!(!is_null($onAddress) && !is_callable($onAddress))) {
             $message = sprintf(
                 'Expected a callable or null, "%s" received.',
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallThrowsExceptionOnInvalidCallback
Failed asserting that exception of type "LogicException" is thrown.

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] Throw_
Instruction/Call.php:46:13
                 var_export($onAddress, true),
             );
 
-            throw new \LogicException($message);
+            new \LogicException($message);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallThrowsExceptionOnInvalidCallback
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallThrowsExceptionOnInvalidCallback
Failed asserting that exception of type "LogicException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Instruction/Call.php:58:13
     public function register(): array
     {
         return [
-            0xE8 => [&$this, 'executeOperandE8'],
+            return [233 => [&$this, 'executeOperandE8']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\CallInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...n\Call', 232)
No registrations for opcode 0xE8 in Call Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!
Tests: 1, Ass

[Killed] DecrementInteger
Instruction/Call.php:58:13
     public function register(): array
     {
         return [
-            0xE8 => [&$this, 'executeOperandE8'],
+            return [231 => [&$this, 'executeOperandE8']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\CallInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...n\Call', 232)
No registrations for opcode 0xE8 in Call Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!
Tests: 1, Ass

[Killed] PublicVisibility
Instruction/Call.php:71:5
      * This instruction parses the opcode information then sends it to a
      * callback function to do something with it.
      */
-    public function executeOperandE8(): bool
+    protected function executeOperandE8(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Error: Call to protected method shanept\AssemblySimulator\Instruction\Call::executeOperandE8() from scope shanept\AssemblySimulatorTests\Unit\Instruction\CallTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:134

2) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest

[Killed] IncrementInteger
Instruction/Call.php:74:9
     public function executeOperandE8(): bool
     {
         $sim = $this->getSimulator();
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(2);
 
         $address = $sim->getCodeAtInstruction(4);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Failed asserting that 6 matches expected 5.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/Call.php:74:9
     public function executeOperandE8(): bool
     {
         $sim = $this->getSimulator();
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(0);
 
         $address = $sim->getCodeAtInstruction(4);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Failed asserting that 4 matches expected 5.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Instruction/Call.php:76:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $address = $sim->getCodeAtInstruction(4);
+        $address = $sim->getCodeAtInstruction(5);
         $sim->advanceInstructionPointer(4);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(5): string does not match expected value.
Failed asserting that 5 matches expected 4.

/home/shane/Documents/code/AssemblySimulator/src/Instr

[Killed] DecrementInteger
Instruction/Call.php:76:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $address = $sim->getCodeAtInstruction(4);
+        $address = $sim->getCodeAtInstruction(3);
         $sim->advanceInstructionPointer(4);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(3): string does not match expected value.
Failed asserting that 3 matches expected 4.

/home/shane/Documents/code/AssemblySimulator/src/Instr

[Killed] DecrementInteger
Instruction/Call.php:77:9
         $sim->advanceInstructionPointer(1);
 
         $address = $sim->getCodeAtInstruction(4);
-        $sim->advanceInstructionPointer(4);
+        $sim->advanceInstructionPointer(3);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Failed asserting that 4 matches expected 5.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Instruction/Call.php:77:9
         $sim->advanceInstructionPointer(1);
 
         $address = $sim->getCodeAtInstruction(4);
-        $sim->advanceInstructionPointer(4);
+        $sim->advanceInstructionPointer(5);
         $address = $this->unpackImmediate($address, Simulator::TYPE_DWRD);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Failed asserting that 6 matches expected 5.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:61

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/Call.php:82:9
 
         // If the most significant bit is set, we have a 2's complement.
         // We should calculate the signed negative integer from it.
-        if (($address >> 31) & 1) {
+        if ($address >> 30 & 1) {
             $address = -(($address ^ 0xFFFFFFFF) + 1);
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Failed asserting that -3218071288 matches expected 1076896008.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:127
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:134

F

[Killed] ShiftRight
Instruction/Call.php:82:9
 
         // If the most significant bit is set, we have a 2's complement.
         // We should calculate the signed negative integer from it.
-        if (($address >> 31) & 1) {
+        if ($address << 31 & 1) {
             $address = -(($address ^ 0xFFFFFFFF) + 1);
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
Failed asserting that 3224379666 matches expected -1070587630.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:183
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:190

F

[Killed] IncrementInteger
Instruction/Call.php:83:13
         // If the most significant bit is set, we have a 2's complement.
         // We should calculate the signed negative integer from it.
         if (($address >> 31) & 1) {
-            $address = -(($address ^ 0xFFFFFFFF) + 1);
+            $address = -(($address ^ 4294967296) + 1);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
Failed asserting that -7519346447 matches expected -1070587630.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:183
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:190

[Killed] DecrementInteger
Instruction/Call.php:83:13
         // If the most significant bit is set, we have a 2's complement.
         // We should calculate the signed negative integer from it.
         if (($address >> 31) & 1) {
-            $address = -(($address ^ 0xFFFFFFFF) + 1);
+            $address = -(($address ^ 4294967294) + 1);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesNegativeAddress
Failed asserting that -1070587629 matches expected -1070587630.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:183
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:190

[Killed] PlusEqual
Instruction/Call.php:88:9
 
         // Get the absolute instruction pointer.
         $instructionPointer = $sim->getInstructionPointer();
-        $instructionPointer += $sim->getAddressBase();
+        $instructionPointer -= $sim->getAddressBase();
 
         $addressSize = $this->getAddressSize();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Failed asserting that 1076895522 matches expected 1076896008.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:127
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:134

FA

[Killed] Assignment
Instruction/Call.php:88:9
 
         // Get the absolute instruction pointer.
         $instructionPointer = $sim->getInstructionPointer();
-        $instructionPointer += $sim->getAddressBase();
+        $instructionPointer = $sim->getAddressBase();
 
         $addressSize = $this->getAddressSize();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Failed asserting that 1076896003 matches expected 1076896008.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:127
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:134

FA

[Killed] Minus
Instruction/Call.php:92:9
 
         $addressSize = $this->getAddressSize();
         $stackPointer = $this->getStackPointerRegister();
-        $stackPosition = $sim->readRegister($stackPointer) - $addressSize;
+        $stackPosition = $sim->readRegister($stackPointer) + $addressSize;
 
         // Push our instruction pointer to the stack.
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Expectation failed for method name is "writeStackAt" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeStackAt(160, Binary String: 0x00000000): void does not match expected value.
Failed asserting that 160 matches expected 96.

/home/shane/Documents/code/AssemblySimulator/src/Ins

[Killed] MethodCallRemoval
Instruction/Call.php:96:9
 
         // Push our instruction pointer to the stack.
         $value = $this->packImmediate($instructionPointer, $addressSize);
-        $sim->writeStackAt($stackPosition, $value);
+        
         $sim->writeRegister($stackPointer, $stackPosition);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Expectation failed for method name is "writeStackAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Instruction/Call.php:97:9
         // Push our instruction pointer to the stack.
         $value = $this->packImmediate($instructionPointer, $addressSize);
         $sim->writeStackAt($stackPosition, $value);
-        $sim->writeRegister($stackPointer, $stackPosition);
+        
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Plus
Instruction/Call.php:104:9
          * pointer. We must make it absolute before attempting the call
          * procedure.
          */
-        $addr = $instructionPointer + $address;
+        $addr = $instructionPointer - $address;
 
         if (is_callable($this->handleAddressCb)) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Failed asserting that -1076895512 matches expected 1076896008.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:127
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Call.php:88
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/CallTest.php:134

F

[Killed] IfNegation
Instruction/Call.php:106:9
          */
         $addr = $instructionPointer + $address;
 
-        if (is_callable($this->handleAddressCb)) {
-            call_user_func($this->handleAddressCb, $addr);
-        }
+        if (!is_callable($this->handleAddressCb)) {
 
         return true;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesInput
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Expectation failed for method name is "mockableCallback" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

ERRORS!
Tests: 2, Assertions: 4, Errors: 1, Failures: 1.

[Killed] FunctionCallRemoval
Instruction/Call.php:107:13
         $addr = $instructionPointer + $address;
 
         if (is_callable($this->handleAddressCb)) {
-            call_user_func($this->handleAddressCb, $addr);
+            
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\CallTest::testCallParsesPositiveAddress
Expectation failed for method name is "mockableCallback" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
