[Killed] IncrementInteger
Instruction/ExclusiveOr.php:32:13
     public function register(): array
     {
         return [
-            0x30 => [&$this, 'executeOperand30'],
+            return [49 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x31 => [&$this, 'executeOperand31'],
             0x32 => [&$this, 'executeOperand32'],
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...siveOr', 48)
No registrations for opcode 0x30 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:32:13
     public function register(): array
     {
         return [
-            0x30 => [&$this, 'executeOperand30'],
+            return [47 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x31 => [&$this, 'executeOperand31'],
             0x32 => [&$this, 'executeOperand32'],
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...siveOr', 48)
No registrations for opcode 0x30 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:33:13
     {
         return [
             0x30 => [&$this, 'executeOperand30'],
-            0x31 => [&$this, 'executeOperand31'],
+            return [0x30 => [&$this, 'executeOperand30'], 48 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x32 => [&$this, 'executeOperand32'],
             0x33 => [&$this, 'executeOperand33'],
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #1 ('shanept\AssemblySimulator\Ins...siveOr', 49)
No registrations for opcode 0x31 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:33:13
     {
         return [
             0x30 => [&$this, 'executeOperand30'],
-            0x31 => [&$this, 'executeOperand31'],
+            return [0x30 => [&$this, 'executeOperand30'], 50 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x32 => [&$this, 'executeOperand32'],
             0x33 => [&$this, 'executeOperand33'],
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #1 ('shanept\AssemblySimulator\Ins...siveOr', 49)
No registrations for opcode 0x31 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:34:13
         return [
             0x30 => [&$this, 'executeOperand30'],
             0x31 => [&$this, 'executeOperand31'],
-            0x32 => [&$this, 'executeOperand32'],
+            return [0x30 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 49 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x33 => [&$this, 'executeOperand33'],
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #2 ('shanept\AssemblySimulator\Ins...siveOr', 50)
No registrations for opcode 0x32 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:34:13
         return [
             0x30 => [&$this, 'executeOperand30'],
             0x31 => [&$this, 'executeOperand31'],
-            0x32 => [&$this, 'executeOperand32'],
+            return [0x30 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 51 => [&$this, 'executeOperand32'], 0x33 => [&$this, 'executeOperand33']];
             0x33 => [&$this, 'executeOperand33'],
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #2 ('shanept\AssemblySimulator\Ins...siveOr', 50)
No registrations for opcode 0x32 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:35:13
             0x30 => [&$this, 'executeOperand30'],
             0x31 => [&$this, 'executeOperand31'],
             0x32 => [&$this, 'executeOperand32'],
-            0x33 => [&$this, 'executeOperand33'],
+            return [0x30 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 50 => [&$this, 'executeOperand33']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #3 ('shanept\AssemblySimulator\Ins...siveOr', 51)
No registrations for opcode 0x33 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:35:13
             0x30 => [&$this, 'executeOperand30'],
             0x31 => [&$this, 'executeOperand31'],
             0x32 => [&$this, 'executeOperand32'],
-            0x33 => [&$this, 'executeOperand33'],
+            return [0x30 => [&$this, 'executeOperand30'], 0x31 => [&$this, 'executeOperand31'], 0x32 => [&$this, 'executeOperand32'], 52 => [&$this, 'executeOperand33']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\ExclusiveOrInstructionRegistrationTest::testRegistrationForOperand with data set #3 ('shanept\AssemblySimulator\Ins...siveOr', 51)
No registrations for opcode 0x33 in ExclusiveOr Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] PublicVisibility
Instruction/ExclusiveOr.php:44:5
      *
      * Implements XOR source8,dest8 for the xor opcode \x30. Result stored in rm.
      */
-    public function executeOperand30(): bool
+    protected function executeOperand30(): bool
     {
         return $this->executeXorWithEncodingMr(Simulator::TYPE_BYTE);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
Error: Call to protected method shanept\AssemblySimulator\Instruction\ExclusiveOr::executeOperand30() from scope shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:66

ERRORS!
Tests: 16, Asser

[Killed] PublicVisibility
Instruction/ExclusiveOr.php:54:5
      *
      * Implements XOR source,dest for the xor opcode \x31. Result stored in rm.
      */
-    public function executeOperand31(): bool
+    protected function executeOperand31(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorWithIncorrectModByteFails
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to protected method shanept\AssemblySimulator\Instruction\ExclusiveOr::executeOperand31() from scope shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest" at
/home/shane/Docu

[Killed] PublicVisibility
Instruction/ExclusiveOr.php:67:5
      *
      * Implements XOR source8,dest8 for the xor opcode \x32. Result stored in reg.
      */
-    public function executeOperand32(): bool
+    protected function executeOperand32(): bool
     {
         return $this->executeXorWithEncodingRm(Simulator::TYPE_BYTE);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor32RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor32RegisterAgainstItselfIsEmpty
Error: Call to protected method shanept\AssemblySimulator\Instruction\ExclusiveOr::executeOperand32() from scope shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:141

ERRORS!
Tests: 16, Asse

[Killed] PublicVisibility
Instruction/ExclusiveOr.php:77:5
      *
      * Implements XOR source,dest for the xor opcode \x33. Result stored in reg.
      */
-    public function executeOperand33(): bool
+    protected function executeOperand33(): bool
     {
         $sim = $this->getSimulator();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor33RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Error: Call to protected method shanept\AssemblySimulator\Instruction\ExclusiveOr::executeOperand33() from scope shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest

/home/shane/Documents/code/AssemblySimulator/

[Survived] MethodCallRemoval
Instruction/ExclusiveOr.php:93:9
     private function preExecXorModRM(int $opSize): array
     {
         $sim = $this->getSimulator();
-        $sim->advanceInstructionPointer(1);
+        
 
         $byte = $sim->getCodeAtInstruction(1);

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:95:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $byte = $sim->getCodeAtInstruction(1);
+        $byte = $sim->getCodeAtInstruction(2);
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor31RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(2): string does not match expected value.
Fai

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:95:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $byte = $sim->getCodeAtInstruction(1);
+        $byte = $sim->getCodeAtInstruction(0);
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor31RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(0): string does not match expected value.
Fai

[Survived] MethodCallRemoval
Instruction/ExclusiveOr.php:96:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $sim->getCodeAtInstruction(1);
-        $sim->advanceInstructionPointer(1);
+        
 
         $byte = $this->parseModRmByte($byte);

[Survived] IncrementInteger
Instruction/ExclusiveOr.php:96:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $sim->getCodeAtInstruction(1);
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(2);
 
         $byte = $this->parseModRmByte($byte);

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:99:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $this->parseModRmByte($byte);
-        if (0b11 !== $byte["mod"]) {
+        if (2 !== $byte["mod"]) {
             $message = sprintf(
                 "XOR expected modrm mod byte to be 0x3, 0x%x received.",
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorWithIncorrectModByteFails
Failed asserting that exception of type "RuntimeException" is thrown.

ERRORS!
Tests: 4, Assertions: 1, Errors: 3, Failures: 1.

[Killed] NotIdentical
Instruction/ExclusiveOr.php:99:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $this->parseModRmByte($byte);
-        if (0b11 !== $byte["mod"]) {
+        if (0b11 === $byte["mod"]) {
             $message = sprintf(
                 "XOR expected modrm mod byte to be 0x3, 0x%x received.",
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorWithIncorrectModByteFails
Failed asserting that exception of type "RuntimeException" is thrown.

ERRORS!
Tests: 4, Assertions: 1, Errors: 3, Failures: 1.

[Killed] Throw_
Instruction/ExclusiveOr.php:105:13
                 $byte["mod"],
             );
 
-            throw new \RuntimeException($message);
+            new \RuntimeException($message);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorWithIncorrectModByteFails
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorWithIncorrectModByteFails
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] CastBool
Instruction/ExclusiveOr.php:109:9
         }
 
         $rex = $sim->getRex();
-        $rexSet = (bool) ($rex & Simulator::REX);
+        $rexSet = $rex & Simulator::REX;
         $regExt = (bool) ($rex & Simulator::REX_R);
         $rmExt = (bool) ($rex & Simulator::REX_B);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #3 ($rexSet) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php on line 91

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/Do

[Survived] BitwiseAnd
Instruction/ExclusiveOr.php:109:9
         }
 
         $rex = $sim->getRex();
-        $rexSet = (bool) ($rex & Simulator::REX);
+        $rexSet = (bool) ($rex | Simulator::REX);
         $regExt = (bool) ($rex & Simulator::REX_R);
         $rmExt = (bool) ($rex & Simulator::REX_B);

[Killed] CastBool
Instruction/ExclusiveOr.php:110:9
 
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $regExt = (bool) ($rex & Simulator::REX_R);
+        $regExt = $rex & Simulator::REX_R;
         $rmExt = (bool) ($rex & Simulator::REX_B);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php on line 91

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/D

[Survived] BitwiseAnd
Instruction/ExclusiveOr.php:110:9
 
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $regExt = (bool) ($rex & Simulator::REX_R);
+        $regExt = (bool) ($rex | Simulator::REX_R);
         $rmExt = (bool) ($rex & Simulator::REX_B);
 

[Killed] CastBool
Instruction/ExclusiveOr.php:111:9
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
         $regExt = (bool) ($rex & Simulator::REX_R);
-        $rmExt = (bool) ($rex & Simulator::REX_B);
+        $rmExt = $rex & Simulator::REX_B;
 
         $reg = Register::getByCode($byte["reg"], $opSize, $rexSet, $regExt);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor30RegisterAgainstItselfIsEmpty
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php on line 92

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/D

[Survived] BitwiseAnd
Instruction/ExclusiveOr.php:111:9
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
         $regExt = (bool) ($rex & Simulator::REX_R);
-        $rmExt = (bool) ($rex & Simulator::REX_B);
+        $rmExt = (bool) ($rex | Simulator::REX_B);
 
         $reg = Register::getByCode($byte["reg"], $opSize, $rexSet, $regExt);

[Killed] ArrayItemRemoval
Instruction/ExclusiveOr.php:116:9
         $reg = Register::getByCode($byte["reg"], $opSize, $rexSet, $regExt);
         $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
 
-        return [
-            'reg' => $reg,
-            'rm' => $rm,
-        ];
+        return ['rm' => $rm];
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
TypeError: MockObject_Simulator_ac389f16::readRegister(): Argument #1 ($register) must be of type array, null given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php on line 99

/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:99
/ho

[Killed] BitwiseXor
Instruction/ExclusiveOr.php:131:9
         $regVal = $sim->readRegister($modrm['reg']);
         $rmVal = $sim->readRegister($modrm['rm']);
 
-        $result = $rmVal ^ $regVal;
+        $result = $rmVal & $regVal;
 
         $sim->writeRegister($modrm['rm'], $result);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor31RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 1234): void does not match expected value.
Failed asserting that

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:133:9
 
         $result = $rmVal ^ $regVal;
 
-        $sim->writeRegister($modrm['rm'], $result);
+        
         $this->operationResult($result);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor31RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:134:9
         $result = $rmVal ^ $regVal;
 
         $sim->writeRegister($modrm['rm'], $result);
-        $this->operationResult($result);
+        
 
         $sim->setFlag(Flags::CF, 0);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:136:9
         $sim->writeRegister($modrm['rm'], $result);
         $this->operationResult($result);
 
-        $sim->setFlag(Flags::CF, 0);
+        $sim->setFlag(Flags::CF, 1);
         $sim->setFlag(Flags::OF, 0);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Assertion for setFlags on Flags::CF:
Failed asserting that 1 matches expected 0.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:386
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:104
/home/shane/Documents/code/AssemblySimulator

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:136:9
         $sim->writeRegister($modrm['rm'], $result);
         $this->operationResult($result);
 
-        $sim->setFlag(Flags::CF, 0);
+        
         $sim->setFlag(Flags::OF, 0);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 4 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:137:9
         $this->operationResult($result);
 
         $sim->setFlag(Flags::CF, 0);
-        $sim->setFlag(Flags::OF, 0);
+        
 
         return true;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 4 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:137:9
         $this->operationResult($result);
 
         $sim->setFlag(Flags::CF, 0);
-        $sim->setFlag(Flags::OF, 0);
+        $sim->setFlag(Flags::OF, -1);
 
         return true;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Assertion for setFlags on Flags::OF:
Failed asserting that -1 matches expected 0.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:386
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:105
/home/shane/Documents/code/AssemblySimulato

[Killed] BitwiseXor
Instruction/ExclusiveOr.php:151:9
         $regVal = $sim->readRegister($modrm['reg']);
         $rmVal = $sim->readRegister($modrm['rm']);
 
-        $result = $regVal ^ $rmVal;
+        $result = $regVal & $rmVal;
 
         $sim->writeRegister($modrm['reg'], $result);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor33RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 1234): void does not match expected value.
Failed asserting that

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:153:9
 
         $result = $regVal ^ $rmVal;
 
-        $sim->writeRegister($modrm['reg'], $result);
+        
         $this->operationResult($result);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXor33RegisterAgainstItselfIsEmpty with data set #0 (3, 69, 0, [9, 1, '%r9d', 32, 4294967295], 1234, '?')
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Survived] MethodCallRemoval
Instruction/ExclusiveOr.php:154:9
         $result = $regVal ^ $rmVal;
 
         $sim->writeRegister($modrm['reg'], $result);
-        $this->operationResult($result);
+        
 
         $sim->setFlag(Flags::CF, 0);

[Survived] DecrementInteger
Instruction/ExclusiveOr.php:156:9
         $sim->writeRegister($modrm['reg'], $result);
         $this->operationResult($result);
 
-        $sim->setFlag(Flags::CF, 0);
+        $sim->setFlag(Flags::CF, -1);
         $sim->setFlag(Flags::OF, 0);
 

[Survived] IncrementInteger
Instruction/ExclusiveOr.php:157:9
         $this->operationResult($result);
 
         $sim->setFlag(Flags::CF, 0);
-        $sim->setFlag(Flags::OF, 0);
+        $sim->setFlag(Flags::OF, 1);
 
         return true;

[Killed] IncrementInteger
Instruction/ExclusiveOr.php:172:9
          * be set to 1. Otherwise, if it were even, the parity flag will be 0.
          */
         $numSetBits = substr_count(decbin($result), "1");
-        $sim->setFlag(Flags::PF, ~$numSetBits & 0x1);
+        $sim->setFlag(Flags::PF, ~$numSetBits & 2);
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Assertion for setFlags on Flags::PF:
Failed asserting that 2 matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:386
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:130
/home/shane/Documents/code/AssemblySimulator

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:172:9
          * be set to 1. Otherwise, if it were even, the parity flag will be 0.
          */
         $numSetBits = substr_count(decbin($result), "1");
-        $sim->setFlag(Flags::PF, ~$numSetBits & 0x1);
+        
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 4 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] DecrementInteger
Instruction/ExclusiveOr.php:179:9
          * If the result of the last operation was negative, set this to 1.
          * Otherwise, set it to 0.
          */
-        $sim->setFlag(Flags::SF, $result < 0 ? 1 : 0);
+        $sim->setFlag(Flags::SF, ($result < 0) ? 1 : -1);
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Assertion for setFlags on Flags::SF:
Failed asserting that -1 matches expected 0.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:386
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:136
/home/shane/Documents/code/AssemblySimulato

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:179:9
          * If the result of the last operation was negative, set this to 1.
          * Otherwise, set it to 0.
          */
-        $sim->setFlag(Flags::SF, $result < 0 ? 1 : 0);
+        
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 4 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Instruction/ExclusiveOr.php:185:9
          * Zero Flag
          * If the result is 0, this flag is set to 1. Otherwise it is set to 0.
          */
-        $sim->setFlag(Flags::ZF, $result === 0 ? 1 : 0);
+        
     }
 }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Expectation failed for method name is "setFlag" when invoked 5 times.
Method was expected to be called 5 times, actually called 4 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
