[Killed] DecrementInteger
Instruction/ExclusiveOr.php:185:9
          * Zero Flag
          * If the result is 0, this flag is set to 1. Otherwise it is set to 0.
          */
-        $sim->setFlag(Flags::ZF, $result === 0 ? 1 : 0);
+        $sim->setFlag(Flags::ZF, ($result === -1) ? 1 : 0);
     }
 }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\ExclusiveOrTest::testXorClearsFlagsAfterExecution
Assertion for setFlags on Flags::ZF:
Failed asserting that 0 matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/ExclusiveOrTest.php:386
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:141
/home/shane/Documents/code/AssemblySimulator
