[Killed] IncrementInteger
Instruction/LoadEffectiveAddress.php:31:13
     public function register(): array
     {
         return [
-            0x8D => [&$this, 'executeOperand8d'],
+            return [142 => [&$this, 'executeOperand8d']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\LoadEffectiveAddressInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...ddress', 141)
No registrations for opcode 0x8D in LoadEffectiveAddress Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase

[Killed] DecrementInteger
Instruction/LoadEffectiveAddress.php:31:13
     public function register(): array
     {
         return [
-            0x8D => [&$this, 'executeOperand8d'],
+            return [140 => [&$this, 'executeOperand8d']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\LoadEffectiveAddressInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...ddress', 141)
No registrations for opcode 0x8D in LoadEffectiveAddress Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase

[Killed] PublicVisibility
Instruction/LoadEffectiveAddress.php:40:5
      *
      * Implements LEA reg,address for the LEA opcode \x8D.
      */
-    public function executeOperand8d(): bool
+    protected function executeOperand8d(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to protected method shanept\AssemblySimulator\Instruction\LoadEffectiveAddress::executeOperand8d() from scope shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffective

[Killed] DecrementInteger
Instruction/LoadEffectiveAddress.php:45:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
+        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(0));
         $sim->advanceInstructionPointer(1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
Expectation failed for method name is "getCodeAtInstruction" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(0): string does not match expected value.
Failed asserting that 0 matches expected 1.

/home/shane/Documents/code/Assembl

[Killed] IncrementInteger
Instruction/LoadEffectiveAddress.php:45:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
+        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(2));
         $sim->advanceInstructionPointer(1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
Expectation failed for method name is "getCodeAtInstruction" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(2): string does not match expected value.
Failed asserting that 2 matches expected 1.

/home/shane/Documents/code/Assembl

[Killed] DecrementInteger
Instruction/LoadEffectiveAddress.php:46:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(0);
 
         $rex = $sim->getRex();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
Failed asserting that 8 matches expected 9.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/LoadEffectiveAddressTest.php:58

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Instruction/LoadEffectiveAddress.php:46:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(2);
 
         $rex = $sim->getRex();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
Failed asserting that 10 matches expected 9.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/LoadEffectiveAddressTest.php:58

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Identical
Instruction/LoadEffectiveAddress.php:56:9
         $addressSize = $sim->getLargestInstructionWidth();
         $reg = Register::getByCode($byte["reg"], $operandSize, $rexSet, $regExt);
 
-        if (0b11 === $byte["mod"]) {
+        if (0b11 !== $byte["mod"]) {
             $message = sprintf(
                 "LEA expected modrm mod byte to be a memory operand, " .
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "unpack(): Argument #1 ($format) must be of type string, null given" at
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/

[Killed] IncrementInteger
Instruction/LoadEffectiveAddress.php:56:9
         $addressSize = $sim->getLargestInstructionWidth();
         $reg = Register::getByCode($byte["reg"], $operandSize, $rexSet, $regExt);
 
-        if (0b11 === $byte["mod"]) {
+        if (4 === $byte["mod"]) {
             $message = sprintf(
                 "LEA expected modrm mod byte to be a memory operand, " .
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
Failed asserting that exception of type "TypeError" matches expected exception "RuntimeException". Message was: "unpack(): Argument #1 ($format) must be of type string, null given" at
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/

[Killed] Concat
Instruction/LoadEffectiveAddress.php:58:17
 
         if (0b11 === $byte["mod"]) {
             $message = sprintf(
-                "LEA expected modrm mod byte to be a memory operand, " .
-                    "register operand 0x%x received instead.",
+                $message = sprintf("register operand 0x%x received instead." . "LEA expected modrm mod byte to be a memory operand, ", $byte["mod"]);
                 $byte["mod"],
             );
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
Failed asserting that exception message 'register operand 0x3 received instead.LEA expected modrm mod byte to be a memory operand, ' contains 'LEA expected modrm mod byte to be a memory operand, register operand 0x3 received instead.'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
Instruction/LoadEffectiveAddress.php:58:17
 
         if (0b11 === $byte["mod"]) {
             $message = sprintf(
-                "LEA expected modrm mod byte to be a memory operand, " .
-                    "register operand 0x%x received instead.",
+                $message = sprintf("register operand 0x%x received instead.", $byte["mod"]);
                 $byte["mod"],
             );
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaThrowsExceptionOnInvalidModBit
Failed asserting that exception message 'register operand 0x3 received instead.' contains 'LEA expected modrm mod byte to be a memory operand, register operand 0x3 received instead.'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Survived] LessThan
Instruction/LoadEffectiveAddress.php:74:9
          * than the address size, we should mask the address down to the operand
          * size.
          */
-        if ($operandSize < $addressSize) {
+        if ($operandSize <= $addressSize) {
             $address &= $reg['mask'];
         }

[Survived] LessThanNegotiation
Instruction/LoadEffectiveAddress.php:74:9
          * than the address size, we should mask the address down to the operand
          * size.
          */
-        if ($operandSize < $addressSize) {
+        if ($operandSize >= $addressSize) {
             $address &= $reg['mask'];
         }

[Killed] Assignment
Instruction/LoadEffectiveAddress.php:75:13
          * size.
          */
         if ($operandSize < $addressSize) {
-            $address &= $reg['mask'];
+            $address = $reg['mask'];
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoadsAddressWithDisplacement
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 4294967295): void does not match expected value.
Failed asserting that 4294967295 matches expected 24.

/home/shane/Documents/co

[Killed] MethodCallRemoval
Instruction/LoadEffectiveAddress.php:78:9
             $address &= $reg['mask'];
         }
 
-        $sim->advanceInstructionPointer($effectiveAddress->getDisplacement());
+        
 
         $sim->writeRegister($reg, $address);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
Failed asserting that 5 matches expected 9.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/LoadEffectiveAddressTest.php:58

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Instruction/LoadEffectiveAddress.php:80:9
 
         $sim->advanceInstructionPointer($effectiveAddress->getDisplacement());
 
-        $sim->writeRegister($reg, $address);
+        
 
         return true;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\LoadEffectiveAddressTest::testLeaLoads64BitAddress
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
