[Killed] PublicVisibility
Instruction/Move.php:62:5
      * Implements MOV r/m8,reg8 for the opcode \x88.
      * This is the alternate encoding of MOV \x8a.
      */
-    public function executeOperand88(): bool
+    protected function executeOperand88(): bool
     {
         return $this->executeMovWithEncodingMr(Simulator::TYPE_BYTE);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperand88() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:215

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::tes

[Killed] PublicVisibility
Instruction/Move.php:73:5
      * Implements MOV r/m,reg for the opcode \x89.
      * This is the alternate encoding of MOV \x8b.
      */
-    public function executeOperand89(): bool
+    protected function executeOperand89(): bool
     {
         $opSize = $this->getOperandSize();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov89OnSibValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov89OnSibValue
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperand89() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:455

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8

[Killed] PublicVisibility
Instruction/Move.php:85:5
      *
      * Implements MOV reg,r/m for the opcode \x8a.
      */
-    public function executeOperand8a(): bool
+    protected function executeOperand8a(): bool
     {
         return $this->executeMovWithEncodingRm(Simulator::TYPE_BYTE);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRexRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRexRegisterValue
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperand8a() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:582

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::

[Killed] PublicVisibility
Instruction/Move.php:95:5
      *
      * Implements MOV reg,r/m for the opcode \x8b.
      */
-    public function executeOperand8b(): bool
+    protected function executeOperand8b(): bool
     {
         $opSize = $this->getOperandSize();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperand8b() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:182

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::

[Killed] PublicVisibility
Instruction/Move.php:107:5
      *
      * Implements MOV reg,imm8 for the opcode range \xB0-\xB7.
      */
-    public function executeOperandBx8(): bool
+    protected function executeOperandBx8(): bool
     {
         $opSize = Simulator::TYPE_BYTE;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperandBx8() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:144

ERRORS!
Tests: 35, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
Instruction/Move.php:118:5
      *
      * Implements MOV reg,imm for the opcode range \xB8-\xBF.
      */
-    public function executeOperandBx(): bool
+    protected function executeOperandBx(): bool
     {
         $opSize = $this->getOperandSize();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #0 (3, 0, 0, '?', Binary String: 0x01202000, [0, 0, '%eax', 32, 4294967295], 2105345)
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperandBx() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimula

[Killed] PublicVisibility
Instruction/Move.php:129:5
      *
      * Implements MOV r/m,imm8 for the opcode \xC6.
      */
-    public function executeOperandC6(): bool
+    protected function executeOperandC6(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperandC6() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:748

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC

[Killed] MethodCallRemoval
Instruction/Move.php:135:9
         $sim->advanceInstructionPointer(1);
 
         $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
-        $sim->advanceInstructionPointer(1);
+        
 
         /**
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Failed asserting that 6 matches expected 7.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:698

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] NotIdentical
Instruction/Move.php:143:9
          * write our value from the register. Otherwise, we are supposed to
          * write to a memory location. We will skip that bit.
          */
-        if (0b11 !== $byte["mod"]) {
+        if (0b11 === $byte["mod"]) {
             $address = $this->parseAddress($byte);
             $sim->advanceInstructionPointer($address->getDisplacement());
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Failed asserting that 3 matches expected 7.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:698

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/Move.php:143:9
          * write our value from the register. Otherwise, we are supposed to
          * write to a memory location. We will skip that bit.
          */
-        if (0b11 !== $byte["mod"]) {
+        if (2 !== $byte["mod"]) {
             $address = $this->parseAddress($byte);
             $sim->advanceInstructionPointer($address->getDisplacement());
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:375
/home/shane/Documents/code/AssemblySimulator/src/Instruction/A

[Killed] MethodCallRemoval
Instruction/Move.php:145:13
          */
         if (0b11 !== $byte["mod"]) {
             $address = $this->parseAddress($byte);
-            $sim->advanceInstructionPointer($address->getDisplacement());
+            
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Failed asserting that 3 matches expected 7.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:698

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Instruction/Move.php:148:9
             $sim->advanceInstructionPointer($address->getDisplacement());
         }
 
-        $immediate = $sim->getCodeAtInstruction(1);
+        $immediate = $sim->getCodeAtInstruction(2);
         $value = $this->unpackImmediate($immediate, 8);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Unknown length 2

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:683
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:111
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:696

FAILURES!

[Killed] DecrementInteger
Instruction/Move.php:148:9
             $sim->advanceInstructionPointer($address->getDisplacement());
         }
 
-        $immediate = $sim->getCodeAtInstruction(1);
+        $immediate = $sim->getCodeAtInstruction(0);
         $value = $this->unpackImmediate($immediate, 8);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Unknown length 0

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:683
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:111
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:696

FAILURES!

[Killed] DecrementInteger
Instruction/Move.php:149:9
         }
 
         $immediate = $sim->getCodeAtInstruction(1);
-        $value = $this->unpackImmediate($immediate, 8);
+        $value = $this->unpackImmediate($immediate, 7);
 
         $sim->advanceInstructionPointer(1);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:112
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.

[Killed] IncrementInteger
Instruction/Move.php:149:9
         }
 
         $immediate = $sim->getCodeAtInstruction(1);
-        $value = $this->unpackImmediate($immediate, 8);
+        $value = $this->unpackImmediate($immediate, 9);
 
         $sim->advanceInstructionPointer(1);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:112
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.

[Killed] MethodCallRemoval
Instruction/Move.php:151:9
         $immediate = $sim->getCodeAtInstruction(1);
         $value = $this->unpackImmediate($immediate, 8);
 
-        $sim->advanceInstructionPointer(1);
+        
 
         if (0b11 === $byte["mod"]) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Failed asserting that 6 matches expected 7.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:698

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Instruction/Move.php:151:9
         $immediate = $sim->getCodeAtInstruction(1);
         $value = $this->unpackImmediate($immediate, 8);
 
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(0);
 
         if (0b11 === $byte["mod"]) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnAddress
Failed asserting that 6 matches expected 7.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:698

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] CastBool
Instruction/Move.php:156:13
         if (0b11 === $byte["mod"]) {
             $rex = $sim->getRex();
             $rexSet = (bool) ($rex & Simulator::REX);
-            $rmExt = (bool) ($rex & Simulator::REX_B);
+            $rmExt = $rex & Simulator::REX_B;
 
             $rm = Register::getByCode($byte["rm"], 8, $rexSet, $rmExt);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php on line 118

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/Documents/code/AssemblySimulator

[Survived] BitwiseAnd
Instruction/Move.php:156:13
         if (0b11 === $byte["mod"]) {
             $rex = $sim->getRex();
             $rexSet = (bool) ($rex & Simulator::REX);
-            $rmExt = (bool) ($rex & Simulator::REX_B);
+            $rmExt = (bool) ($rex | Simulator::REX_B);
 
             $rm = Register::getByCode($byte["rm"], 8, $rexSet, $rmExt);

[Killed] DecrementInteger
Instruction/Move.php:158:13
             $rexSet = (bool) ($rex & Simulator::REX);
             $rmExt = (bool) ($rex & Simulator::REX_B);
 
-            $rm = Register::getByCode($byte["rm"], 8, $rexSet, $rmExt);
+            $rm = Register::getByCode($byte["rm"], 7, $rexSet, $rmExt);
             $sim->writeRegister($rm, $value);
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:730
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:118
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/

[Killed] IncrementInteger
Instruction/Move.php:158:13
             $rexSet = (bool) ($rex & Simulator::REX);
             $rmExt = (bool) ($rex & Simulator::REX_B);
 
-            $rm = Register::getByCode($byte["rm"], 8, $rexSet, $rmExt);
+            $rm = Register::getByCode($byte["rm"], 9, $rexSet, $rmExt);
             $sim->writeRegister($rm, $value);
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:730
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:118
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/

[Killed] MethodCallRemoval
Instruction/Move.php:159:13
             $rmExt = (bool) ($rex & Simulator::REX_B);
 
             $rm = Register::getByCode($byte["rm"], 8, $rexSet, $rmExt);
-            $sim->writeRegister($rm, $value);
+            
         }
         // This is where we *should* save to a memory location. We won't.
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC6OnRegister
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Instruction/Move.php:171:5
      *
      * Implements MOV r/m,imm16/32 for the opcode \xC7.
      */
-    public function executeOperandC7(): bool
+    protected function executeOperandC7(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7WithOp66InProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7WithOp66InProtectedMode
Error: Call to protected method shanept\AssemblySimulator\Instruction\Move::executeOperandC7() from scope shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:905

2) shanept\AssemblySimulatorTests\Unit\Instruction\MoveT

[Killed] IncrementInteger
Instruction/Move.php:185:9
         * write our value from the register. Otherwise, we are supposed to
         * write to a memory location. We will skip that bit.
         */
-        if (0b11 !== $byte["mod"]) {
+        if (4 !== $byte["mod"]) {
             $address = $this->parseAddress($byte);
             $sim->advanceInstructionPointer($address->getDisplacement());
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
TypeError: unpack(): Argument #1 ($format) must be of type string, null given

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:234
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:375
/home/shane/Documents/code/AssemblySimulator/src/Instruction/A

[Killed] DecrementInteger
Instruction/Move.php:192:9
 
         // Now we load the Immediate value
         $opSize = min(Simulator::TYPE_DWRD, $this->getOperandSize());
-        $immediate = $sim->getCodeAtInstruction($opSize / 8);
+        $immediate = $sim->getCodeAtInstruction($opSize / 7);
         $value = $this->unpackImmediate($immediate, $opSize);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
Unknown length 4.5714285714286

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:785
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:147
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:798

FAILURES!

[Killed] IncrementInteger
Instruction/Move.php:192:9
 
         // Now we load the Immediate value
         $opSize = min(Simulator::TYPE_DWRD, $this->getOperandSize());
-        $immediate = $sim->getCodeAtInstruction($opSize / 8);
+        $immediate = $sim->getCodeAtInstruction($opSize / 9);
         $value = $this->unpackImmediate($immediate, $opSize);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
Unknown length 3.5555555555556

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:785
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:147
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:798

FAILURES!

[Killed] DecrementInteger
Instruction/Move.php:195:9
         $immediate = $sim->getCodeAtInstruction($opSize / 8);
         $value = $this->unpackImmediate($immediate, $opSize);
 
-        $sim->advanceInstructionPointer($opSize / 8);
+        $sim->advanceInstructionPointer($opSize / 7);
 
         if (0b11 === $byte["mod"]) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
TypeError: MockObject_Simulator_baa81710::advanceInstructionPointer(): Argument #1 ($amount) must be of type int, float given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php on line 149

/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:149
/home/shane/Documents/cod

[Killed] MethodCallRemoval
Instruction/Move.php:195:9
         $immediate = $sim->getCodeAtInstruction($opSize / 8);
         $value = $this->unpackImmediate($immediate, $opSize);
 
-        $sim->advanceInstructionPointer($opSize / 8);
+        
 
         if (0b11 === $byte["mod"]) {
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnAddress
Failed asserting that 6 matches expected 10.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:800

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Instruction/Move.php:203:13
             $rmExt = (bool) ($rex & Simulator::REX_B);
 
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
-            $sim->writeRegister($rm, $value);
+            
         }
         // This is where we *should* save to a memory location. We won't.
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovC7OnRegister
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] NotIdentical
Instruction/Move.php:232:9
         $value = $sim->readRegister($reg);
 
         // We have an address
-        if (0b11 !== $byte['mod']) {
+        if (0b11 === $byte['mod']) {
             $address = $this->parseAddress($byte);
             $sim->advanceInstructionPointer($address->getDisplacement());
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([...]): int does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] DecrementInteger
Instruction/Move.php:232:9
         $value = $sim->readRegister($reg);
 
         // We have an address
-        if (0b11 !== $byte['mod']) {
+        if (2 !== $byte['mod']) {
             $address = $this->parseAddress($byte);
             $sim->advanceInstructionPointer($address->getDisplacement());
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([...]): int does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] MethodCallRemoval
Instruction/Move.php:239:13
         } else {
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
 
-            $sim->writeRegister($rm, $value);
+            
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov88OnRegisterValue
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Identical
Instruction/Move.php:270:9
          * source our value from the register. Otherwise, we load it from a
          * memory address.
          */
-        if (0b11 === $byte["mod"]) {
+        if (0b11 !== $byte["mod"]) {
             $rmExt = (bool) ($rex & Simulator::REX_B);
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 0): void does not match expected value.
Failed asserting that 0 matches expected 2854249.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/

[Killed] IncrementInteger
Instruction/Move.php:270:9
          * source our value from the register. Otherwise, we load it from a
          * memory address.
          */
-        if (0b11 === $byte["mod"]) {
+        if (4 === $byte["mod"]) {
             $rmExt = (bool) ($rex & Simulator::REX_B);
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRegisterValue
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([...]): int does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] BitwiseAnd
Instruction/Move.php:271:13
          * memory address.
          */
         if (0b11 === $byte["mod"]) {
-            $rmExt = (bool) ($rex & Simulator::REX_B);
+            $rmExt = (bool) ($rex | Simulator::REX_B);
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
             $value = $sim->readRegister($rm);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bOnRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bOnRegisterValue
Expectation failed for method name is "readRegister" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::readRegister([...]): int does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] CastBool
Instruction/Move.php:271:13
          * memory address.
          */
         if (0b11 === $byte["mod"]) {
-            $rmExt = (bool) ($rex & Simulator::REX_B);
+            $rmExt = $rex & Simulator::REX_B;
             $rm = Register::getByCode($byte["rm"], $opSize, $rexSet, $rmExt);
             $value = $sim->readRegister($rm);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRexRegisterValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8aOnRexRegisterValue
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php on line 211

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/Documents/code/AssemblyS

[Killed] MethodCallRemoval
Instruction/Move.php:280:9
             $value = $address->getAddress();
         }
 
-        $sim->writeRegister($reg, $value);
+        
 
         return true;
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMov8bLoadsMemoryAddress
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Instruction/Move.php:295:9
         $sim = $this->getSimulator();
 
         // Get the last bit of the operand.
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(1)) & 8;
         $sim->advanceInstructionPointer(1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 1): void does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] DecrementInteger
Instruction/Move.php:295:9
         $sim = $this->getSimulator();
 
         // Get the last bit of the operand.
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(0)) & 0x7;
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #0 (3, 0, 0, '?', Binary String: 0x01202000, [0, 0, '%eax', 32, 4294967295], 2105345)
Expected string of length 0, received "?".

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:83
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:230
/ho
