[Survived] DecrementInteger
Instruction/Move.php:296:9
 
         // Get the last bit of the operand.
         $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(0);
 
         $value = $sim->getCodeAtInstruction($opSize / 8);

[Survived] MethodCallRemoval
Instruction/Move.php:296:9
 
         // Get the last bit of the operand.
         $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
-        $sim->advanceInstructionPointer(1);
+        
 
         $value = $sim->getCodeAtInstruction($opSize / 8);

[Killed] Division
Instruction/Move.php:298:9
         $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
         $sim->advanceInstructionPointer(1);
 
-        $value = $sim->getCodeAtInstruction($opSize / 8);
+        $value = $sim->getCodeAtInstruction($opSize * 8);
         $value = $this->unpackImmediate($value, $opSize);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #0 (3, 0, 0, '?', Binary String: 0x01202000, [0, 0, '%eax', 32, 4294967295], 2105345)
Expected string of length 256, received "   ".

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:83
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:23

[Killed] DecrementInteger
Instruction/Move.php:298:9
         $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
         $sim->advanceInstructionPointer(1);
 
-        $value = $sim->getCodeAtInstruction($opSize / 8);
+        $value = $sim->getCodeAtInstruction($opSize / 7);
         $value = $this->unpackImmediate($value, $opSize);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #0 (3, 0, 0, '?', Binary String: 0x01202000, [0, 0, '%eax', 32, 4294967295], 2105345)
Expected string of length 4, received "   ".

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/MoveTest.php:83
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:232

[Killed] IncrementInteger
Instruction/Move.php:301:9
         $value = $sim->getCodeAtInstruction($opSize / 8);
         $value = $this->unpackImmediate($value, $opSize);
 
-        $sim->advanceInstructionPointer($opSize / 8);
+        $sim->advanceInstructionPointer($opSize / 9);
 
         $rex = $sim->getRex();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
TypeError: MockObject_Simulator_e5e1fefa::advanceInstructionPointer(): Argument #1 ($amount) must be of type int, float given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php on line 234

/home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php:234
/home/shane/

[Killed] BitwiseAnd
Instruction/Move.php:305:9
 
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $regExt = (bool) ($rex & Simulator::REX_B);
+        $regExt = (bool) ($rex | Simulator::REX_B);
 
         $register = Register::getByCode($opcode, $opSize, $rexSet, $regExt);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #8 (3, 72, 0, '?', Binary String: 0x0120200000000000, [0, 0, '%rax', 64, 9223372036854775807], 2105345)
Expectation failed for method name is "writeRegister" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeRegister([...], 2105345): void does not matc

[Killed] CastBool
Instruction/Move.php:305:9
 
         $rex = $sim->getRex();
         $rexSet = (bool) ($rex & Simulator::REX);
-        $regExt = (bool) ($rex & Simulator::REX_B);
+        $regExt = $rex & Simulator::REX_B;
 
         $register = Register::getByCode($opcode, $opSize, $rexSet, $regExt);
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate8bitValue
TypeError: shanept\AssemblySimulator\Register::getByCode(): Argument #4 ($rExtend) must be of type bool, int given, called in /home/shane/Documents/code/AssemblySimulator/src/Instruction/Move.php on line 238

/home/shane/Documents/code/AssemblySimulator/src/Register.php:715
/home/shane/Documents/code/Asse

[Killed] MethodCallRemoval
Instruction/Move.php:309:9
 
         $register = Register::getByCode($opcode, $opSize, $rexSet, $regExt);
 
-        $sim->writeRegister($register, $value);
+        
 
         return true;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\MoveTest::testMovBxLoadsImmediate32bitValue with data set #0 (3, 0, 0, '?', Binary String: 0x01202000, [0, 0, '%eax', 32, 4294967295], 2105345)
Expectation failed for method name is "writeRegister" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
