[Killed] IncrementInteger
Instruction/NoOperation.php:28:13
     public function register(): array
     {
         return [
-            0x90 => [&$this, 'executeOperand90'],
+            return [145 => [&$this, 'executeOperand90'], 0xf1f => [&$this, 'executeOperand0F1F']];
             0x0F1F => [&$this, 'executeOperand0F1F'],
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\NoOperationInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...ration', 144)
No registrations for opcode 0x90 in NoOperation Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/NoOperation.php:28:13
     public function register(): array
     {
         return [
-            0x90 => [&$this, 'executeOperand90'],
+            return [143 => [&$this, 'executeOperand90'], 0xf1f => [&$this, 'executeOperand0F1F']];
             0x0F1F => [&$this, 'executeOperand0F1F'],
         ];
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\NoOperationInstructionRegistrationTest::testRegistrationForOperand with data set #0 ('shanept\AssemblySimulator\Ins...ration', 144)
No registrations for opcode 0x90 in NoOperation Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURES!

[Killed] DecrementInteger
Instruction/NoOperation.php:29:13
     {
         return [
             0x90 => [&$this, 'executeOperand90'],
-            0x0F1F => [&$this, 'executeOperand0F1F'],
+            return [0x90 => [&$this, 'executeOperand90'], 3870 => [&$this, 'executeOperand0F1F']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\NoOperationInstructionRegistrationTest::testRegistrationForOperand with data set #1 ('shanept\AssemblySimulator\Ins...ration', 3871)
No registrations for opcode 0xF1F in NoOperation Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURE

[Killed] IncrementInteger
Instruction/NoOperation.php:29:13
     {
         return [
             0x90 => [&$this, 'executeOperand90'],
-            0x0F1F => [&$this, 'executeOperand0F1F'],
+            return [0x90 => [&$this, 'executeOperand90'], 3872 => [&$this, 'executeOperand0F1F']];
         ];
     }
statusReason: 1) shanept\AssemblySimulatorTests\Integration\InstructionRegistration\NoOperationInstructionRegistrationTest::testRegistrationForOperand with data set #1 ('shanept\AssemblySimulator\Ins...ration', 3871)
No registrations for opcode 0xF1F in NoOperation Instruction.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/InstructionRegistration/InstructionRegistrationTestBase.php:57

FAILURE

[Killed] PublicVisibility
Instruction/NoOperation.php:36:5
     /**
      * Performs a No Operation (NOOP).
      */
-    public function executeOperand90(): bool
+    protected function executeOperand90(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand90LeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand90LeavesRegistersAndStackAlone
Error: Call to protected method shanept\AssemblySimulator\Instruction\NoOperation::executeOperand90() from scope shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/NoOperationTest.php:46

ERRORS!
T

[Killed] PublicVisibility
Instruction/NoOperation.php:47:5
     /**
      * Performs a No Operation (NOOP).
      */
-    public function executeOperand0F1F(): bool
+    protected function executeOperand0F1F(): bool
     {
         $sim = $this->getSimulator();
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
Error: Call to protected method shanept\AssemblySimulator\Instruction\NoOperation::executeOperand0F1F() from scope shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/NoOperationTest.ph

[Killed] DecrementInteger
Instruction/NoOperation.php:53:9
         $sim->advanceInstructionPointer(1);
 
         // First byte is a ModRM.
-        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
+        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(0));
         $sim->advanceInstructionPointer(1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
Expectation failed for method name is "getCodeAtInstruction" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(0): string does not match expected value.
Failed asserting that 0 matches expected 1.

/home/shane/D

[Killed] IncrementInteger
Instruction/NoOperation.php:53:9
         $sim->advanceInstructionPointer(1);
 
         // First byte is a ModRM.
-        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(1));
+        $byte = $this->parseModRmByte($sim->getCodeAtInstruction(2));
         $sim->advanceInstructionPointer(1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FWithAddressLeavesRegistersAndStackAlone
Expectation failed for method name is "getCodeAtInstruction" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(2): string does not match expected value.
Failed asserting that 2 matches expected 1.

/home/shane/D

[Killed] Identical
Instruction/NoOperation.php:57:9
         $sim->advanceInstructionPointer(1);
 
         // If we don't have to parse an address, we are done.
-        if (0b11 === $byte['mod']) {
+        if (0b11 !== $byte['mod']) {
             return true;
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
shanept\AssemblySimulator\Simulator::readRegister([...]): int was not expected to be called.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:369
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:285
/home

[Killed] DecrementInteger
Instruction/NoOperation.php:57:9
         $sim->advanceInstructionPointer(1);
 
         // If we don't have to parse an address, we are done.
-        if (0b11 === $byte['mod']) {
+        if (2 === $byte['mod']) {
             return true;
         }
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
shanept\AssemblySimulator\Simulator::readRegister([...]): int was not expected to be called.

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:369
/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:285
/home

[Killed] TrueValue
Instruction/NoOperation.php:58:13
 
         // If we don't have to parse an address, we are done.
         if (0b11 === $byte['mod']) {
-            return true;
+            return false;
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\NoOperationTest::testNoOperationOperand0F1FLeavesRegistersAndStackAlone
Failed asserting that false is true.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/NoOperationTest.php:84

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
