[Killed] PublicVisibility
Instruction/Pop.php:47:5
      *
      * Implements POP register for the pop opcode range 0x58 - 0x5F.
      */
-    public function executeOperand5x(): bool
+    protected function executeOperand5x(): bool
     {
         $sim = $this->getSimulator();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PopTest::testPopOffStack with data set #0 (3, 'X', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], [8, 0, '%r8', 64, 9223372036854775807], 23452, Binary String: 0x9c5b000000000000)
Error: Call to protected method shanept\AssemblySimulator\Instruction\Pop::executeOperand5x() from scope shanept\AssemblySimulatorTests\Unit\Instruction\PopTest

/home/

[Killed] DecrementInteger
Instruction/Pop.php:51:9
     {
         $sim = $this->getSimulator();
 
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(0)) & 0x7;
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PopTest::testPopOffStack with data set #0 (3, 'X', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], [8, 0, '%r8', 64, 9223372036854775807], 23452, Binary String: 0x9c5b000000000000)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtIn

[Killed] DecrementInteger
Instruction/Pop.php:51:9
     {
         $sim = $this->getSimulator();
 
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(1)) & 6;
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PopTest::testPopOffStack with data set #19 (3, ']', 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], [5, 5, '%ebp', 32, 4294967295], 352366, Binary String: 0x6e60050000000000)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'offset' => 4
     'code' => 4

[Survived] IncrementInteger
Instruction/Pop.php:52:9
         $sim = $this->getSimulator();
 
         $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(2);
 
         $opSize = $this->getOperandSize();

[Survived] MethodCallRemoval
Instruction/Pop.php:65:9
         $register = Register::getByCode($opcode, $opSize, $rexSet, $regExt);
 
         $value = $sim->readStackAt($stackPosition, $opSize);
-        $sim->clearStackAt($stackPosition, $opSize);
+        
 
         $value = $this->unpackImmediate($value, $opSize);

[Killed] MethodCallRemoval
Instruction/Pop.php:69:9
 
         $value = $this->unpackImmediate($value, $opSize);
 
-        $sim->writeRegister($stackPointer, $stackPosition + $opSize);
+        
         $sim->writeRegister($register, $value);
 
statusReason: PHPUnit 10.5.22 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.6
Configuration: /tmp/infection/phpunitConfiguration.f360cea88d8bb32508127524929bb439.infection.xml

......................RRRRRRR                                     29 / 29 (100%)

Time: 00:00.067, Memory: 12.00 MB

[Survived] Plus
Instruction/Pop.php:69:9
 
         $value = $this->unpackImmediate($value, $opSize);
 
-        $sim->writeRegister($stackPointer, $stackPosition + $opSize);
+        $sim->writeRegister($stackPointer, $stackPosition - $opSize);
         $sim->writeRegister($register, $value);
 

[Survived] MethodCallRemoval
Instruction/Pop.php:70:9
         $value = $this->unpackImmediate($value, $opSize);
 
         $sim->writeRegister($stackPointer, $stackPosition + $opSize);
-        $sim->writeRegister($register, $value);
+        
 
         return true;
