[Killed] IncrementInteger
Instruction/Push.php:53:9
     {
         $sim = $this->getSimulator();
 
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(1)) & 8;
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack5x with data set #1 (3, 'Q', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], 42, [9, 1, '%r9', 64, 9223372036854775807], 625226, Binary String: 0x4a8a090000000000)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    'offset' => 9
-    'code' => 1

[Killed] IncrementInteger
Instruction/Push.php:53:9
     {
         $sim = $this->getSimulator();
 
-        $opcode = ord($sim->getCodeAtInstruction(1)) & 0x7;
+        $opcode = ord($sim->getCodeAtInstruction(2)) & 0x7;
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack5x with data set #0 (3, 'P', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], 32, [8, 0, '%r8', 64, 9223372036854775807], 43256146, Binary String: 0x5209940200000000)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::g

[Killed] Division
Instruction/Push.php:60:9
         $stackPointer = $this->getStackPointerRegister();
 
         // Incrememnt stack pointer
-        $stackPosition = $sim->readRegister($stackPointer) - ($opSize / 8);
+        $stackPosition = $sim->readRegister($stackPointer) - $opSize * 8;
         $sim->writeRegister($stackPointer, $stackPosition);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack5x with data set #0 (3, 'P', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], 32, [8, 0, '%r8', 64, 9223372036854775807], 43256146, Binary String: 0x5209940200000000)
Expectation failed for method name is "writeRegister" when invoked zero or more times
Parameter 1 for invocation shanept\AssemblySimulator\Simulator::writeReg

[Killed] IncrementInteger
Instruction/Push.php:60:9
         $stackPointer = $this->getStackPointerRegister();
 
         // Incrememnt stack pointer
-        $stackPosition = $sim->readRegister($stackPointer) - ($opSize / 8);
+        $stackPosition = $sim->readRegister($stackPointer) - $opSize / 9;
         $sim->writeRegister($stackPointer, $stackPosition);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack5x with data set #0 (3, 'P', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], 32, [8, 0, '%r8', 64, 9223372036854775807], 43256146, Binary String: 0x5209940200000000)
TypeError: MockObject_Simulator_556ab03b::writeRegister(): Argument #2 ($value) must be of type int, float given, called in /home/shane/Documents/code/Assembl

[Survived] MethodCallRemoval
Instruction/Push.php:61:9
 
         // Incrememnt stack pointer
         $stackPosition = $sim->readRegister($stackPointer) - ($opSize / 8);
-        $sim->writeRegister($stackPointer, $stackPosition);
+        
 
         $rex = $sim->getRex();

[Killed] MethodCallRemoval
Instruction/Push.php:72:9
         $value = $sim->readRegister($register);
 
         $value = $this->packImmediate($value, $opSize);
-        $sim->writeStackAt($stackPosition, $value);
+        
 
         return true;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack5x with data set #0 (3, 'P', 73, 0, [4, 4, '%rsp', 64, 9223372036854775807], 32, [8, 0, '%r8', 64, 9223372036854775807], 43256146, Binary String: 0x5209940200000000)
Expectation failed for method name is "writeStackAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests:

[Killed] PublicVisibility
Instruction/Push.php:82:5
      *
      * Performs PUSH imm16/32/64 for opcode 0x68.
      */
-    public function executeOperand68(): bool
+    protected function executeOperand68(): bool
     {
         $sim = $this->getSimulator();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack68 with data set #0 (3, 72, 0, [4, 4, '%rsp', 64, 9223372036854775807], 33, Binary String: 0x3400420059001200)
Error: Call to protected method shanept\AssemblySimulator\Instruction\Push::executeOperand68() from scope shanept\AssemblySimulatorTests\Unit\Instruction\PushTest

/home/shane/Documents/code/AssemblySimulator/test

[Killed] IncrementInteger
Instruction/Push.php:88:9
         $sim->advanceInstructionPointer(1);
 
         $opSize = $this->getOperandSize();
-        $opDisp = $opSize / 8;
+        $opDisp = $opSize / 9;
         $value = $sim->getCodeAtInstruction($opDisp);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack68 with data set #0 (3, 72, 0, [4, 4, '%rsp', 64, 9223372036854775807], 33, Binary String: 0x3400420059001200)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(7.111111111111111): string does not

[Killed] DecrementInteger
Instruction/Push.php:88:9
         $sim->advanceInstructionPointer(1);
 
         $opSize = $this->getOperandSize();
-        $opDisp = $opSize / 8;
+        $opDisp = $opSize / 7;
         $value = $sim->getCodeAtInstruction($opDisp);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack68 with data set #0 (3, 72, 0, [4, 4, '%rsp', 64, 9223372036854775807], 33, Binary String: 0x3400420059001200)
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(9.142857142857142): string does not

[Survived] MethodCallRemoval
Instruction/Push.php:91:9
         $opDisp = $opSize / 8;
         $value = $sim->getCodeAtInstruction($opDisp);
 
-        $sim->advanceInstructionPointer($opDisp);
+        
 
         $stackPointer = $this->getStackPointerRegister();

[Killed] Minus
Instruction/Push.php:94:9
         $sim->advanceInstructionPointer($opDisp);
 
         $stackPointer = $this->getStackPointerRegister();
-        $stackPosition = $sim->readRegister($stackPointer) - $opDisp;
+        $stackPosition = $sim->readRegister($stackPointer) + $opDisp;
 
         $sim->writeRegister($stackPointer, $stackPosition);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack68 with data set #0 (3, 72, 0, [4, 4, '%rsp', 64, 9223372036854775807], 33, Binary String: 0x3400420059001200)
Expectation failed for method name is "writeStackAt" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeStackAt(41, Binary String: 0x3400420059001200): void does not match exp

[Survived] MethodCallRemoval
Instruction/Push.php:96:9
         $stackPointer = $this->getStackPointerRegister();
         $stackPosition = $sim->readRegister($stackPointer) - $opDisp;
 
-        $sim->writeRegister($stackPointer, $stackPosition);
+        
         $sim->writeStackAt($stackPosition, $value);
 

[Killed] MethodCallRemoval
Instruction/Push.php:97:9
         $stackPosition = $sim->readRegister($stackPointer) - $opDisp;
 
         $sim->writeRegister($stackPointer, $stackPosition);
-        $sim->writeStackAt($stackPosition, $value);
+        
 
         return true;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack68 with data set #0 (3, 72, 0, [4, 4, '%rsp', 64, 9223372036854775807], 33, Binary String: 0x3400420059001200)
Expectation failed for method name is "writeStackAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 30, Assertions: 88, Failures: 1.

[Killed] PublicVisibility
Instruction/Push.php:107:5
      *
      * Performs PUSH imm8 for opcode 0x6a.
      */
-    public function executeOperand6a(): bool
+    protected function executeOperand6a(): bool
     {
         $sim = $this->getSimulator();
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack6a with data set #0 (3, 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], 3, 'C')
Error: Call to protected method shanept\AssemblySimulator\Instruction\Push::executeOperand6a() from scope shanept\AssemblySimulatorTests\Unit\Instruction\PushTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/Instruction/PushTest.php:

[Killed] DecrementInteger
Instruction/Push.php:112:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $value = $sim->getCodeAtInstruction(1);
+        $value = $sim->getCodeAtInstruction(0);
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack6a with data set #0 (3, 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], 3, 'C')
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(0): string does not match expected value.
Failed asserting that 0 m

[Killed] IncrementInteger
Instruction/Push.php:112:9
         $sim = $this->getSimulator();
         $sim->advanceInstructionPointer(1);
 
-        $value = $sim->getCodeAtInstruction(1);
+        $value = $sim->getCodeAtInstruction(2);
         $sim->advanceInstructionPointer(1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack6a with data set #0 (3, 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], 3, 'C')
Expectation failed for method name is "getCodeAtInstruction" when invoked zero or more times
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::getCodeAtInstruction(2): string does not match expected value.
Failed asserting that 2 m

[Survived] DecrementInteger
Instruction/Push.php:113:9
         $sim->advanceInstructionPointer(1);
 
         $value = $sim->getCodeAtInstruction(1);
-        $sim->advanceInstructionPointer(1);
+        $sim->advanceInstructionPointer(0);
 
         $opSize = Simulator::TYPE_BYTE;

[Survived] MethodCallRemoval
Instruction/Push.php:113:9
         $sim->advanceInstructionPointer(1);
 
         $value = $sim->getCodeAtInstruction(1);
-        $sim->advanceInstructionPointer(1);
+        
 
         $opSize = Simulator::TYPE_BYTE;

[Killed] IncrementInteger
Instruction/Push.php:117:9
 
         $opSize = Simulator::TYPE_BYTE;
         $stackPointer = $this->getStackPointerRegister();
-        $stackPosition = $sim->readRegister($stackPointer) - 1;
+        $stackPosition = $sim->readRegister($stackPointer) - 2;
 
         $sim->writeRegister($stackPointer, $stackPosition);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack6a with data set #0 (3, 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], 3, 'C')
Expectation failed for method name is "writeStackAt" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeStackAt(1, 'C'): void does not match expected value.
Failed asserting that 1 matches expected 2.

/home

[Killed] DecrementInteger
Instruction/Push.php:117:9
 
         $opSize = Simulator::TYPE_BYTE;
         $stackPointer = $this->getStackPointerRegister();
-        $stackPosition = $sim->readRegister($stackPointer) - 1;
+        $stackPosition = $sim->readRegister($stackPointer) - 0;
 
         $sim->writeRegister($stackPointer, $stackPosition);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\Instruction\PushTest::testPushOnStack6a with data set #0 (3, 0, 0, [4, 4, '%rsp', 64, 9223372036854775807], 3, 'C')
Expectation failed for method name is "writeStackAt" when invoked 1 time
Parameter 0 for invocation shanept\AssemblySimulator\Simulator::writeStackAt(3, 'C'): void does not match expected value.
Failed asserting that 3 matches expected 2.

/home
