[Killed] PublicVisibility
Register.php:715:5
      *
      * @return RegisterObj An array representing the requested register.
      */
-    public static function getByCode(
+    protected static function getByCode(int $id, int $size, bool $rexSet = false, bool $rExtend = false): array
         int $id,
         int $size,
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonRex
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonRex
Error: Call to protected method shanept\AssemblySimulator\Register::getByCode() from scope shanept\AssemblySimulatorTests\Unit\RegistersTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:259

2) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonExt

[Killed] FalseValue
Register.php:718:9
     public static function getByCode(
         int $id,
         int $size,
-        bool $rexSet = false,
+        public static function getByCode(int $id, int $size, bool $rexSet = true, bool $rExtend = false): array
         bool $rExtend = false,
     ): array {
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonRex
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonRex
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%ah'
+'%spl'

[Killed] FalseValue
Register.php:719:9
         int $id,
         int $size,
         bool $rexSet = false,
-        bool $rExtend = false,
+        public static function getByCode(int $id, int $size, bool $rexSet = false, bool $rExtend = true): array
     ): array {
         if ($rexSet && $rExtend) {
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonExtended
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCodeDefaultsToNonExtended
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%rsp'
+'%r12'

[Killed] LogicalAndNegation
Register.php:721:9
         bool $rexSet = false,
         bool $rExtend = false,
     ): array {
-        if ($rexSet && $rExtend) {
+        if (!($rexSet && $rExtend)) {
             return self::REX_ID_MAP[$id][$size];
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #0 (0, 8, false, false, '%al')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%al'
+'%r8b'

[Killed] LogicalAndAllSubExprNegation
Register.php:721:9
         bool $rexSet = false,
         bool $rExtend = false,
     ): array {
-        if ($rexSet && $rExtend) {
+        if (!$rexSet && !$rExtend) {
             return self::REX_ID_MAP[$id][$size];
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #0 (0, 8, false, false, '%al')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%al'
+'%r8b'

[Killed] IncrementInteger
Register.php:726:9
         }
 
         // If we have a rex value, but REX_R is not set...
-        if ($rexSet && ! $rExtend && $size === 8) {
+        if ($rexSet && !$rExtend && $size === 9) {
             $size = 80;
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #21 (4, 8, true, false, '%spl')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%spl'
+'%ah'

[Killed] LogicalAndSingleSubExprNegation
Register.php:726:9
         }
 
         // If we have a rex value, but REX_R is not set...
-        if ($rexSet && ! $rExtend && $size === 8) {
+        if (!$rexSet && !$rExtend && $size === 8) {
             $size = 80;
         }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #20 (4, 8, false, false, '%ah')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'%ah'
+'%spl'

[Killed] DecrementInteger
Register.php:727:13
 
         // If we have a rex value, but REX_R is not set...
         if ($rexSet && ! $rExtend && $size === 8) {
-            $size = 80;
+            $size = 79;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #1 (0, 8, true, false, '%al')
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:658
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:244

2) shanept\AssemblySimulat

[Killed] IncrementInteger
Register.php:727:13
 
         // If we have a rex value, but REX_R is not set...
         if ($rexSet && ! $rExtend && $size === 8) {
-            $size = 80;
+            $size = 81;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testRegisterGetCode with data set #1 (0, 8, true, false, '%al')
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:658
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:244

2) shanept\AssemblySimulat
