[Killed] Coalesce
Simulator.php:185:9
      */
     public function __construct(?int $mode = null)
     {
-        $this->mode = $mode ?? self::REAL_MODE;
+        $this->mode = self::REAL_MODE ?? $mode;
 
         // Set an appropriately high stack address, dependent on mode, where
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp16RegistersInLongMode
Failed asserting that 8 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:47

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] DecrementInteger
Simulator.php:189:9
 
         // Set an appropriately high stack address, dependent on mode, where
         // the leading 4 bits are 0011.
-        $this->stackAddress = 2 ** ($this->getLargestInstructionWidth() - 2) - 1;
+        $this->stackAddress = 1 ** ($this->getLargestInstructionWidth() - 2) - 1;
 
         // Limit the maximum size of our stack to a reasonable amount.
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testStackIsClearedAfterReset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testStackIsClearedAfterReset
shanept\AssemblySimulator\Exception\StackUnderflow: Stack underflow. Offset 0x3FFF requested. Stack starts at 0x0.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:468
/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:313

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::t

[Killed] Exponentiation
Simulator.php:189:9
 
         // Set an appropriately high stack address, dependent on mode, where
         // the leading 4 bits are 0011.
-        $this->stackAddress = 2 ** ($this->getLargestInstructionWidth() - 2) - 1;
+        $this->stackAddress = 2 / ($this->getLargestInstructionWidth() - 2) - 1;
 
         // Limit the maximum size of our stack to a reasonable amount.
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
TypeError: Cannot assign float to property shanept\AssemblySimulator\Simulator::$stackAddress of type int

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:165
/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:16

2) shanept\AssemblySimulatorTests\Integratio

[Killed] Minus
Simulator.php:193:9
 
         // Limit the maximum size of our stack to a reasonable amount.
         // Max is approx 16MB
-        $this->stackSize = min(0xFFFFFF, 2 ** ((4 << $this->mode) - 1) - 1);
+        $this->stackSize = min(0xffffff, 2 ** ((4 << $this->mode) + 1) - 1);
 
         // Sets the simulator up to a known state.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultStackSizeForModes with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Failed asserting that exception of type "RangeException" is thrown.

FAILURES!
Tests: 187, Assertions: 245, Failures: 1.

[Killed] DecrementInteger
Simulator.php:193:9
 
         // Limit the maximum size of our stack to a reasonable amount.
         // Max is approx 16MB
-        $this->stackSize = min(0xFFFFFF, 2 ** ((4 << $this->mode) - 1) - 1);
+        $this->stackSize = min(16777214, 2 ** ((4 << $this->mode) - 1) - 1);
 
         // Sets the simulator up to a known state.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultStackSizeForModes with data set "Long Mode" ('long', 3, 4611686018427387903, 16777215, 16, 64)
RangeException: Exceeded maximum stack size. Attempted to allocate 16777215 new bytes to the stack, however it exceeds the maximum stack size of 16777214.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:484
/home/shane/Docum

[Killed] MethodCallRemoval
Simulator.php:196:9
         $this->stackSize = min(0xFFFFFF, 2 ** ((4 << $this->mode) - 1) - 1);
 
         // Sets the simulator up to a known state.
-        $this->reset();
+        
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackAddressChangesStackAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRegistersAreClearAfterReset with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Failed asserting that actual size 2 matches expected size 8.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:273

ERRORS!
Tests: 23, Assertions: 17, Errors: 1, Failures: 1, Warnings: 3, Skipped: 8.

[Killed] PublicVisibility
Simulator.php:212:5
      * @param AssemblyInstruction $reference A reference to the class implementing the instruction.
      * @param callable[]          $mappings  A list of opcode - callable mappings to register with the simulator.
      */
-    public function registerInstructions(
+    protected function registerInstructions(AssemblyInstruction $reference, array $mappings): void
         AssemblyInstruction $reference,
         array $mappings,
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::registerInstructions() from scope shanept\AssemblySimulator\Instruction\AssemblyInstruction

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:59
/home/shane/Documents/code/AssemblySimulator/tests/Integra

[Killed] FunctionCallRemoval
Simulator.php:217:9
         array $mappings,
     ): void {
         $record = ['reference' => $reference, 'mappings' => $mappings];
-        array_unshift($this->registeredInstructions, $record);
+        
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

ERRORS!
Tests: 36, Assertions: 42, Errors: 3, Failures: 1.

[Killed] PublicVisibility
Simulator.php:223:5
     /**
      * Clears our registers and lets us run again.
      */
-    public function reset(): void
+    protected function reset(): void
     {
         $this->tainted = false;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackAddressChangesStackAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackAddressChangesStackAddress
Error: Call to protected method shanept\AssemblySimulator\Simulator::reset() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:409

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testCodeBufferIsClearedAfterReset

[Killed] FalseValue
Simulator.php:225:9
      */
     public function reset(): void
     {
-        $this->tainted = false;
+        $this->tainted = true;
 
         $this->rex = 0;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\Tainted" matches expected exception "shanept\AssemblySimulator\Exception\InvalidOpcode". Message was: "Attempted to operate a tainted environment. Did you forget to reset?" at
/home/shane/Documents/code/AssemblySimula

[Killed] DecrementInteger
Simulator.php:227:9
     {
         $this->tainted = false;
 
-        $this->rex = 0;
+        $this->rex = -1;
         $this->prefixes = [];
         $this->buffer = "";
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Simulator.php:231:9
         $this->prefixes = [];
         $this->buffer = "";
 
-        $this->eFlags = 0;
+        $this->eFlags = -1;
         $this->stack = "";
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that -1 matches expected 17.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

FAILURES!
Tests: 54, Assertions: 95, Failures: 1.

[Killed] IncrementInteger
Simulator.php:235:9
         $this->stack = "";
 
         // 16 and 32 bit use 8 registers, 64-bit uses 16.
-        $numRegisters = max(8, 2 << $this->mode);
+        $numRegisters = max(8, 3 << $this->mode);
         $this->registers = array_fill(0, $numRegisters, 0);
 
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp8RegistersInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp8RegistersInProtectedMode
Failed asserting that 12 matches expected 8.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:35

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Simulator.php:235:9
         $this->stack = "";
 
         // 16 and 32 bit use 8 registers, 64-bit uses 16.
-        $numRegisters = max(8, 2 << $this->mode);
+        $numRegisters = max(8, 1 << $this->mode);
         $this->registers = array_fill(0, $numRegisters, 0);
 
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp16RegistersInLongMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp16RegistersInLongMode
Failed asserting that 8 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:47

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Simulator.php:236:9
 
         // 16 and 32 bit use 8 registers, 64-bit uses 16.
         $numRegisters = max(8, 2 << $this->mode);
-        $this->registers = array_fill(0, $numRegisters, 0);
+        $this->registers = array_fill(0, $numRegisters, -1);
 
         // Set the stack pointer to the stack address.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRegistersAreClearAfterReset with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => 0
-    1 => 0

[Killed] IncrementInteger
Simulator.php:236:9
 
         // 16 and 32 bit use 8 registers, 64-bit uses 16.
         $numRegisters = max(8, 2 << $this->mode);
-        $this->registers = array_fill(0, $numRegisters, 0);
+        $this->registers = array_fill(1, $numRegisters, 0);
 
         // Set the stack pointer to the stack address.
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     '%rbp' => 5
     '%rsi' => 6
     '%rdi' => 7

[Killed] PublicVisibility
Simulator.php:245:5
     /**
      * Returns the mode under which we are operating.
      */
-    public function getMode(): int
+    protected function getMode(): int
     {
         return $this->mode;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::getMode() from scope shanept\AssemblySimulator\Instruction\AssemblyInstruction

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:78
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveO

[Killed] PublicVisibility
Simulator.php:253:5
     /**
      * Returns a user-readable name for the mode under which we are operating.
      */
-    public function getModeName(): string
+    protected function getModeName(): string
     {
         return self::MODE_NAMES[$this->mode];
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetModes with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Error: Call to protected method shanept\AssemblySimulator\Simulator::getModeName() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:87

2) shanept\AssemblySimulatorTests\Unit\Simulato

[Killed] PublicVisibility
Simulator.php:263:5
      *
      * @param int $mode The machine mode to operate in.
      */
-    public function setMode(int $mode): void
+    protected function setMode(int $mode): void
     {
         $this->tainted = true;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetModes with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Error: Call to protected method shanept\AssemblySimulator\Simulator::setMode() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:83

2) shanept\AssemblySimulatorTests\Unit\SimulatorTes

[Killed] TrueValue
Simulator.php:265:9
      */
     public function setMode(int $mode): void
     {
-        $this->tainted = true;
+        $this->tainted = false;
 
         $this->mode = $mode;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\InvalidOpcode" matches expected exception "shanept\AssemblySimulator\Exception\Tainted". Message was: "Encountered unknown opcode 0x90 at offset 0 (0x0)." at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/h

[Killed] PublicVisibility
Simulator.php:275:5
      *
      * @param int $address The starting address of the stack.
      */
-    public function setStackAddress(int $address): void
+    protected function setStackAddress(int $address): void
     {
         $this->tainted = true;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackAddressChangesStackAddress
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackAddressChangesStackAddress
Error: Call to protected method shanept\AssemblySimulator\Simulator::setStackAddress() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:408

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithI

[Killed] PublicVisibility
Simulator.php:287:5
      *
      * @param int $size The maximum size for the stack.
      */
-    public function setStackSize(int $size): void
+    protected function setStackSize(int $size): void
     {
         $this->tainted = true;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSizeTaintsSimulator
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSizeTaintsSimulator
Error: Call to protected method shanept\AssemblySimulator\Simulator::setStackSize() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:423

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([B

[Killed] PublicVisibility
Simulator.php:299:5
      *
      * @param int $flag The flag to retreive.
      */
-    public function getFlag(int $flag): bool
+    protected function getFlag(int $flag): bool
     {
         $factor = $flag & -$flag;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
Error: Call to protected method shanept\AssemblySimulator\Simulator::getFlag() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:355

ERRORS!
Tests: 110, Assertions: 92, Errors: 1, Skipped: 44.

[Killed] BitwiseAnd
Simulator.php:301:9
      */
     public function getFlag(int $flag): bool
     {
-        $factor = $flag & -$flag;
+        $factor = $flag | -$flag;
         return (($this->eFlags & $flag) / $factor) === 1;
     }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
Failed asserting that false matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:355

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Division
Simulator.php:302:9
     public function getFlag(int $flag): bool
     {
         $factor = $flag & -$flag;
-        return (($this->eFlags & $flag) / $factor) === 1;
+        return ($this->eFlags & $flag) * $factor === 1;
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetFlag
Failed asserting that false matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:355

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] BitwiseAnd
Simulator.php:302:9
     public function getFlag(int $flag): bool
     {
         $factor = $flag & -$flag;
-        return (($this->eFlags & $flag) / $factor) === 1;
+        return ($this->eFlags | $flag) / $factor === 1;
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that false is true.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:370

FAILURES!
Tests: 54, Assertions: 96, Failures: 1.

[Killed] PublicVisibility
Simulator.php:308:5
     /**
      * Returns all flags.
      */
-    public function getFlags(): int
+    protected function getFlags(): int
     {
         return $this->eFlags;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Error: Call to protected method shanept\AssemblySimulator\Simulator::getFlags() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

ERRORS!
Tests: 110, Assertions: 174, Errors: 1, Skipped: 3.

[Killed] PublicVisibility
Simulator.php:319:5
      * @param int $flag  The flag to be set.
      * @param int $value The value to set the flag to.
      */
-    public function setFlag(int $flag, int $value): void
+    protected function setFlag(int $flag, int $value): void
     {
         $factor = $flag & -$flag;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::setFlag() from scope shanept\AssemblySimulator\Instruction\ExclusiveOr

/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:172
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:134
/home

[Killed] BitwiseNot
Simulator.php:324:9
         $factor = $flag & -$flag;
 
         // Remove the existing flag.
-        $this->eFlags &= ~$flag;
+        $this->eFlags &= $flag;
 
         // Add the new flag.
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that 16 matches expected 17.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

FAILURES!
Tests: 54, Assertions: 95, Failures: 1.

[Killed] Assignment
Simulator.php:324:9
         $factor = $flag & -$flag;
 
         // Remove the existing flag.
-        $this->eFlags &= ~$flag;
+        $this->eFlags = ~$flag;
 
         // Add the new flag.
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that -1 matches expected 17.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

FAILURES!
Tests: 54, Assertions: 95, Failures: 1.

[Killed] Assignment
Simulator.php:327:9
         $this->eFlags &= ~$flag;
 
         // Add the new flag.
-        $this->eFlags += $value * $factor;
+        $this->eFlags = $value * $factor;
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that 16 matches expected 17.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

FAILURES!
Tests: 54, Assertions: 95, Failures: 1.

[Killed] PlusEqual
Simulator.php:327:9
         $this->eFlags &= ~$flag;
 
         // Add the new flag.
-        $this->eFlags += $value * $factor;
+        $this->eFlags -= $value * $factor;
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testMultipleSetFlags
Failed asserting that -33 matches expected 17.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:369

FAILURES!
Tests: 54, Assertions: 95, Failures: 1.

[Killed] PublicVisibility
Simulator.php:333:5
     /**
      * Gets the current REX value (if applicable).
      */
-    public function getRex(): int
+    protected function getRex(): int
     {
         return $this->rex;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::getRex() from scope shanept\AssemblySimulator\Instruction\AssemblyInstruction

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:79
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr

[Killed] PublicVisibility
Simulator.php:343:5
      *
      * @return int[]
      */
-    public function getPrefixes(): array
+    protected function getPrefixes(): array
     {
         return $this->prefixes;
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexOnLongModeIsRecorded with data set #0 (64)
Error: Call to protected method shanept\AssemblySimulator\Simulator::getPrefixes() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:1244
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:631
/home

[Killed] PublicVisibility
Simulator.php:353:5
      *
      * @param int $prefix The prefix to check for.
      */
-    public function hasPrefix(int $prefix): bool
+    protected function hasPrefix(int $prefix): bool
     {
         return in_array($prefix, $this->prefixes, true);
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::hasPrefix() from scope shanept\AssemblySimulator\Instruction\AssemblyInstruction

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:85
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Exclusiv

[Killed] PublicVisibility
Simulator.php:361:5
     /**
      * Gets the memory address base.
      */
-    public function getAddressBase(): int
+    protected function getAddressBase(): int
     {
         return $this->addressBase;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultAddressBaseIsZero
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultAddressBaseIsZero
Error: Call to protected method shanept\AssemblySimulator\Simulator::getAddressBase() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:97

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAddressBaseAfterSet
Error: Cal

[Killed] PublicVisibility
Simulator.php:371:5
      *
      * @param int $base The address base.
      */
-    public function setAddressBase(int $base): void
+    protected function setAddressBase(int $base): void
     {
         $this->addressBase = $base;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAddressBaseAfterSet
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAddressBaseAfterSet
Error: Call to protected method shanept\AssemblySimulator\Simulator::setAddressBase() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:107

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIs

[Killed] PublicVisibility
Simulator.php:379:5
     /**
      * Returns the largest allowable instruction size on this mode.
      */
-    public function getLargestInstructionWidth(): int
+    protected function getLargestInstructionWidth(): int
     {
         // Returns the bit-width of our architecture.
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::getLargestInstructionWidth() from scope shanept\AssemblySimulator\Instruction\AssemblyInstruction

/home/shane/Documents/code/AssemblySimulator/src/Instruction/AssemblyInstruction.php:75
/home/shane/Documents/code/AssemblySimulator/src/Ins

[Killed] ShiftLeft
Simulator.php:382:9
     public function getLargestInstructionWidth(): int
     {
         // Returns the bit-width of our architecture.
-        return 8 << $this->mode;
+        return 8 >> $this->mode;
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetLargestInstructionWidth with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Failed asserting that 4 matches expected 16.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:127

ERRORS!
Tests: 104, Assertions: 83, Errors: 20, Failures: 1, Skipped: 4.

[Killed] IncrementInteger
Simulator.php:382:9
     public function getLargestInstructionWidth(): int
     {
         // Returns the bit-width of our architecture.
-        return 8 << $this->mode;
+        return 9 << $this->mode;
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testSettingDifferentWidthRegisters with data set #0 (1, [0, 0, '%ax', 16, 65535], 65535, [0, 0, '%al', 8, 255], 0, 65280)
Failed asserting that 255 matches expected 65280.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:160

ERRORS!
Tests: 15, Assertions: 13, Errors: 2, Failures: 1, Warnings: 1.

[Killed] PublicVisibility
Simulator.php:390:5
      *
      * @return int[]
      */
-    public function getRawRegisters(): array
+    protected function getRawRegisters(): array
     {
         return $this->registers;
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp8RegistersInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimulatorSetsUp8RegistersInProtectedMode
Error: Call to protected method shanept\AssemblySimulator\Simulator::getRawRegisters() from scope shanept\AssemblySimulatorTests\Unit\RegistersTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:33

2) shanept\AssemblySimulatorTests\Unit\RegistersTest::testEnsureSimu

[Killed] PublicVisibility
Simulator.php:400:5
      *
      * @return int[]
      */
-    public function getIndexedRegisters(): array
+    protected function getIndexedRegisters(): array
     {
         $size = $this->getLargestInstructionWidth();
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
Error: Call to protected method shanept\AssemblySimulator\Simulator::getIndexedRegisters() from scope shanept\AssemblySimulatorTests\Unit\RegistersTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:110

ERRORS!
Tests: 98, Assertions: 97, Errors: 1.
