[Killed] DecrementInteger
Simulator.php:407:9
 
         $indexedRegisters = [];
 
-        for ($i = 0; $i < $numRegisters; $i++) {
+        for ($i = -1; $i < $numRegisters; $i++) {
             // If we are past register 8, we are into our extended registers.
             $id = $i % 8;
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:730
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:354
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:110

[Killed] Increment
Simulator.php:407:9
 
         $indexedRegisters = [];
 
-        for ($i = 0; $i < $numRegisters; $i++) {
+        for ($i = 0; $i < $numRegisters; $i--) {
             // If we are past register 8, we are into our extended registers.
             $id = $i % 8;
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:730
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:354
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:110

[Killed] IncrementInteger
Simulator.php:409:13
 
         for ($i = 0; $i < $numRegisters; $i++) {
             // If we are past register 8, we are into our extended registers.
-            $id = $i % 8;
+            $id = $i % 9;
             $rex = $i > 7;
 
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:722
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:354
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:110

[Killed] Modulus
Simulator.php:409:13
 
         for ($i = 0; $i < $numRegisters; $i++) {
             // If we are past register 8, we are into our extended registers.
-            $id = $i % 8;
+            $id = $i * 8;
             $rex = $i > 7;
 
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
TypeError: shanept\AssemblySimulator\Register::getByCode(): Return value must be of type array, null returned

/home/shane/Documents/code/AssemblySimulator/src/Register.php:730
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:354
/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:110

[Killed] GreaterThanNegotiation
Simulator.php:410:13
         for ($i = 0; $i < $numRegisters; $i++) {
             // If we are past register 8, we are into our extended registers.
             $id = $i % 8;
-            $rex = $i > 7;
+            $rex = $i <= 7;
 
             $register = Register::getByCode($id, $size, $rex, $rex);
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    '%rax' => 0
-    '%rcx' => 1

[Killed] GreaterThan
Simulator.php:410:13
         for ($i = 0; $i < $numRegisters; $i++) {
             // If we are past register 8, we are into our extended registers.
             $id = $i % 8;
-            $rex = $i > 7;
+            $rex = $i >= 7;
 
             $register = Register::getByCode($id, $size, $rex, $rex);
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testGetIndexedRegisters
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     '%rsp' => 4
     '%rbp' => 5
     '%rsi' => 6

[Killed] PublicVisibility
Simulator.php:427:5
      *
      * @return int
      */
-    public function readRegister(array $register): int
+    protected function readRegister(array $register): int
     {
         $largestWidth = $this->getLargestInstructionWidth();
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadRegisterOnSizeLargerThanMachineWidth
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to protected method shanept\AssemblySimulator\Simulator::readRegister() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest" at
/home/shane/Documents/code/AssemblySimulator/tests

[Killed] GreaterThanNegotiation
Simulator.php:435:9
         $width = $register["width"];
         $mask = $register["mask"];
 
-        if ($width > $largestWidth) {
+        if ($width <= $largestWidth) {
             $message = sprintf(
                 'Register "%s" too large for mode "%s".',
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadRegisterOnSizeLargerThanMachineWidth
Failed asserting that exception of type "RuntimeException" is thrown.

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] GreaterThan
Simulator.php:435:9
         $width = $register["width"];
         $mask = $register["mask"];
 
-        if ($width > $largestWidth) {
+        if ($width >= $largestWidth) {
             $message = sprintf(
                 'Register "%s" too large for mode "%s".',
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
RuntimeException: Register "%rax" too large for mode "long".

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:374
/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:25

2) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
RuntimeExce

[Killed] IfNegation
Simulator.php:447:9
 
         $value = $this->registers[$offset];
 
-        if (is_int($value)) {
-            $value &= $mask;
-        }
+        if (!is_int($value)) {
 
         return $value;
killedBy: shanept\AssemblySimulatorTests\Unit\RegistersTest::testReadingSmallerRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testReadingSmallerRegister
Failed asserting that 1431655765 matches expected 85.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:175

FAILURES!
Tests: 13, Assertions: 13, Failures: 1.

[Killed] Assignment
Simulator.php:448:13
         $value = $this->registers[$offset];
 
         if (is_int($value)) {
-            $value &= $mask;
+            $value = $mask;
         }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Simulator.php:464:5
      *                         large for our simulation mode. (i.e. writing to
      *                         64-bit register in 16-bit REAL mode).
      */
-    public function writeRegister(array $register, int $value): void
+    protected function writeRegister(array $register, int $value): void
     {
         $this->taintProtection();
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::writeRegister() from scope shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:20

2) shanept\AssemblySimulatorTests\Integration\RexTest::test

[Killed] NotIdentical
Simulator.php:494:9
          * handled unless we are running REAL mode and writing a 16 bit
          * operation.
          */
-        if (self::LONG_MODE !== $this->mode || $width < self::TYPE_DWRD) {
+        if (self::LONG_MODE === $this->mode || $width < self::TYPE_DWRD) {
             // Our underlying register is $largestWidth bits long. We are
             // writing to $register['width'] bits at the bottom end.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testSettingDifferentWidthRegisters with data set #4 (3, [0, 0, '%rax', 64, 9223372036854775807], 9223372036854775807, [0, 0, '%eax', 32, 4294967295], 4294967295, 4294967295)
Failed asserting that 9223372036854775807 matches expected 4294967295.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:160

FAILURES!
Tests: 19,

[Killed] LogicalOrNegation
Simulator.php:494:9
          * handled unless we are running REAL mode and writing a 16 bit
          * operation.
          */
-        if (self::LONG_MODE !== $this->mode || $width < self::TYPE_DWRD) {
+        if (!(self::LONG_MODE !== $this->mode || $width < self::TYPE_DWRD)) {
             // Our underlying register is $largestWidth bits long. We are
             // writing to $register['width'] bits at the bottom end.
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 0 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] BitwiseXor
Simulator.php:504:13
             $oldValue = $this->registers[$offset];
 
             // This gives us the value with $register['width'] bits zeroed.
-            $oldValue &= $modeMask ^ $mask;
+            $oldValue &= $modeMask & $mask;
 
             // And writes our new value to the register.
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 65535 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Simulator.php:504:13
             $oldValue = $this->registers[$offset];
 
             // This gives us the value with $register['width'] bits zeroed.
-            $oldValue &= $modeMask ^ $mask;
+            $oldValue = $modeMask ^ $mask;
 
             // And writes our new value to the register.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testSettingDifferentWidthRegisters with data set #2 (2, [0, 0, '%eax', 32, 4294967295], 4227858431, [0, 0, '%al', 8, 255], 42, 4227858218)
Failed asserting that 4294967082 matches expected 4227858218.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:160

FAILURES!
Tests: 16, Assertions: 16, Failures: 1.

[Killed] Assignment
Simulator.php:507:13
             $oldValue &= $modeMask ^ $mask;
 
             // And writes our new value to the register.
-            $value += $oldValue;
+            $value = $oldValue;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\RegistersTest::testWriteRegister with data set #0 ([0, 0, '%ax', 16, 65535], 135)
Failed asserting that 0 matches expected 135.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/RegistersTest.php:82

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PlusEqual
Simulator.php:507:13
             $oldValue &= $modeMask ^ $mask;
 
             // And writes our new value to the register.
-            $value += $oldValue;
+            $value -= $oldValue;
         }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 65536 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Simulator.php:516:5
     /**
      * Returns a copy of the internal representation of the stack.
      */
-    public function getStack(): string
+    protected function getStack(): string
     {
         return $this->stack;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
Error: Call to protected method shanept\AssemblySimulator\Simulator::getStack() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:681

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultStackIsEmpty
Error: Ca

[Killed] PublicVisibility
Simulator.php:529:5
      *
      * @return string The value of the stack at the specified position, as a binary string.
      */
-    public function readStackAt(int $offset, int $length): string
+    protected function readStackAt(int $offset, int $length): string
     {
         if ($offset > $this->stackAddress) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
Failed asserting that exception of type "Error" matches expected exception "shanept\AssemblySimulator\Exception\StackUnderflow". Message was: "Call to protected method shanept\AssemblySimulator\Simulator::readStackAt() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest" at
/home/shane/Documents/co

[Killed] GreaterThanNegotiation
Simulator.php:531:9
      */
     public function readStackAt(int $offset, int $length): string
     {
-        if ($offset > $this->stackAddress) {
+        if ($offset <= $this->stackAddress) {
             $message = sprintf(
                 'Stack underflow. Offset 0x%X requested. Stack starts at 0x%X.',
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\StackUnderflow" is thrown.

FAILURES!
Tests: 74, Assertions: 123, Failures: 1.

[Killed] GreaterThan
Simulator.php:531:9
      */
     public function readStackAt(int $offset, int $length): string
     {
-        if ($offset > $this->stackAddress) {
+        if ($offset >= $this->stackAddress) {
             $message = sprintf(
                 'Stack underflow. Offset 0x%X requested. Stack starts at 0x%X.',
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAt with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
shanept\AssemblySimulator\Exception\StackUnderflow: Stack underflow. Offset 0x3FFF requested. Stack starts at 0x3FFF.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:446
/home/shane/Documents/code/AssemblySimulator/tests/Unit/Sim

[Killed] Throw_
Simulator.php:538:13
                 $this->stackAddress,
             );
 
-            throw new Exception\StackUnderflow($message);
+            new Exception\StackUnderflow($message);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackUnderflowThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\StackUnderflow" is thrown.

FAILURES!
Tests: 79, Assertions: 131, Failures: 1.

[Killed] IncrementInteger
Simulator.php:544:9
         $stackLength = strlen($this->stack);
 
         // This makes our offset relative to the start of the stack string.
-        $stackOffset = $offset - ($this->stackAddress - $stackLength) - 1;
+        $stackOffset = $offset - ($this->stackAddress - $stackLength) - 2;
 
         if ($stackOffset < 0) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAt with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Assertion failure at position 0 (0x3FFF).
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x03
+Binary String: 0x04

[Killed] Minus
Simulator.php:544:9
         $stackLength = strlen($this->stack);
 
         // This makes our offset relative to the start of the stack string.
-        $stackOffset = $offset - ($this->stackAddress - $stackLength) - 1;
+        $stackOffset = $offset - ($this->stackAddress + $stackLength) - 1;
 
         if ($stackOffset < 0) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAt with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
shanept\AssemblySimulator\Exception\StackIndex: Stack offset 0x3FFF requested, but it exceeds the top of the stack (0x3FFE)

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:453
/home/shane/Documents/code/AssemblySimulator/tests/Un

[Killed] LessThanNegotiation
Simulator.php:546:9
         // This makes our offset relative to the start of the stack string.
         $stackOffset = $offset - ($this->stackAddress - $stackLength) - 1;
 
-        if ($stackOffset < 0) {
+        if ($stackOffset >= 0) {
             $message = sprintf(
                 'Stack offset 0x%X requested, but it exceeds the top of the ' .
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\StackIndex" is thrown.

FAILURES!
Tests: 78, Assertions: 130, Failures: 1.

[Killed] LessThan
Simulator.php:546:9
         // This makes our offset relative to the start of the stack string.
         $stackOffset = $offset - ($this->stackAddress - $stackLength) - 1;
 
-        if ($stackOffset < 0) {
+        if ($stackOffset <= 0) {
             $message = sprintf(
                 'Stack offset 0x%X requested, but it exceeds the top of the ' .
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAt with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
shanept\AssemblySimulator\Exception\StackIndex: Stack offset 0x3FFE requested, but it exceeds the top of the stack (0x3FFE)

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:453
/home/shane/Documents/code/AssemblySimulator/tests/Un

[Killed] ConcatOperandRemoval
Simulator.php:548:17
 
         if ($stackOffset < 0) {
             $message = sprintf(
-                'Stack offset 0x%X requested, but it exceeds the top of the ' .
-                'stack (0x%X)',
+                $message = sprintf('Stack offset 0x%X requested, but it exceeds the top of the ', $offset, $this->stackAddress - $stackLength + 1);
                 $offset,
                 $this->stackAddress - $stackLength + 1,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'Stack offset 0x11D0 requested, but it exceeds the top of the ' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFA)'.

FAILURES!
Tests: 82, Assertions: 138, Failures: 1.

[Killed] Concat
Simulator.php:548:17
 
         if ($stackOffset < 0) {
             $message = sprintf(
-                'Stack offset 0x%X requested, but it exceeds the top of the ' .
-                'stack (0x%X)',
+                $message = sprintf('stack (0x%X)' . 'Stack offset 0x%X requested, but it exceeds the top of the ', $offset, $this->stackAddress - $stackLength + 1);
                 $offset,
                 $this->stackAddress - $stackLength + 1,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'stack (0x11D0)Stack offset 0x3FFA requested, but it exceeds the top of the ' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFA)'.

FAILURES!
Tests: 79, Assertions: 132, Failures: 1.

[Killed] Plus
Simulator.php:551:17
                 'Stack offset 0x%X requested, but it exceeds the top of the ' .
                 'stack (0x%X)',
                 $offset,
-                $this->stackAddress - $stackLength + 1,
+                $message = sprintf('Stack offset 0x%X requested, but it exceeds the top of the ' . 'stack (0x%X)', $offset, $this->stackAddress - $stackLength - 1);
             );
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FF8)' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFA)'.

FAILURES!
Tests: 80, Assertions: 134, Failures: 1.

[Killed] DecrementInteger
Simulator.php:551:17
                 'Stack offset 0x%X requested, but it exceeds the top of the ' .
                 'stack (0x%X)',
                 $offset,
-                $this->stackAddress - $stackLength + 1,
+                $message = sprintf('Stack offset 0x%X requested, but it exceeds the top of the ' . 'stack (0x%X)', $offset, $this->stackAddress - $stackLength + 0);
             );
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FF9)' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFA)'.

FAILURES!
Tests: 79, Assertions: 133, Failures: 1.

[Killed] Throw_
Simulator.php:554:13
                 $this->stackAddress - $stackLength + 1,
             );
 
-            throw new Exception\StackIndex($message);
+            new Exception\StackIndex($message);
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAtInvalidOffsetThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\StackIndex" is thrown.

FAILURES!
Tests: 83, Assertions: 139, Failures: 1.

[Killed] UnwrapSubstr
Simulator.php:558:9
         }
 
         // Our offset is relative to the end of the string.
-        return substr($this->stack, $stackOffset, $length);
+        return $this->stack;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testReadStackAt with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Assertion failure at position 0 (0x3FFF).
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x03
+Binary String: 0x0403

[Killed] PublicVisibility
Simulator.php:567:5
      * @param int    $offset The stack offset at which to write the value.
      * @param string $value  The value to write to the stack, as a binary string.
      */
-    public function writeStackAt(int $offset, string $value): void
+    protected function writeStackAt(int $offset, string $value): void
     {
         if ($offset > $this->stackAddress) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackUnderflowThrowsException
Failed asserting that exception of type "Error" matches expected exception "shanept\AssemblySimulator\Exception\StackUnderflow". Message was: "Call to protected method shanept\AssemblySimulator\Simulator::writeStackAt() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest" at
/home/shane/Documents/

[Killed] Minus
Simulator.php:581:9
 
         $valueLength = strlen($value);
         $stackLength = strlen($this->stack);
-        $availableBytes = $this->stackSize - $stackLength;
+        $availableBytes = $this->stackSize + $stackLength;
 
         // This makes our offset relative to the start of the stack string.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultStackSizeForModes with data set "Real Mode" ('real', 1, 16383, 127, 8, 16)
Failed asserting that exception of type "RangeException" is thrown.

FAILURES!
Tests: 83, Assertions: 136, Failures: 1.

[Killed] LessThanNegotiation
Simulator.php:591:9
          * bytes we have been provided with to write to the stack, we will
          * zero-extend the value by the required amount.
          */
-        if ($stackOffset < 0) {
+        if ($stackOffset >= 0) {
             $newBytesLength = ($stackOffset * -1);
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0403
+Binary String: 0x04

[Killed] LessThan
Simulator.php:591:9
          * bytes we have been provided with to write to the stack, we will
          * zero-extend the value by the required amount.
          */
-        if ($stackOffset < 0) {
+        if ($stackOffset <= 0) {
             $newBytesLength = ($stackOffset * -1);
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0201
+Binary String: 0x02c301

[Killed] DecrementInteger
Simulator.php:592:13
          * zero-extend the value by the required amount.
          */
         if ($stackOffset < 0) {
-            $newBytesLength = ($stackOffset * -1);
+            $newBytesLength = $stackOffset * -2;
 
             if ($newBytesLength > $availableBytes) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0403
+Binary String: 0x0400

[Killed] IncrementInteger
Simulator.php:592:13
          * zero-extend the value by the required amount.
          */
         if ($stackOffset < 0) {
-            $newBytesLength = ($stackOffset * -1);
+            $newBytesLength = $stackOffset * -0;
 
             if ($newBytesLength > $availableBytes) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #1 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x040003)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x040003
+Binary String: 0x0403

[Killed] GreaterThan
Simulator.php:594:13
         if ($stackOffset < 0) {
             $newBytesLength = ($stackOffset * -1);
 
-            if ($newBytesLength > $availableBytes) {
+            if ($newBytesLength >= $availableBytes) {
                 $message = sprintf(
                     'Exceeded maximum stack size. Attempted to allocate %d ' .
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #4 (['4E'], Binary String: 0x3445000000000...0000000)
RangeException: Exceeded maximum stack size. Attempted to allocate 127 new bytes to the stack, however it exceeds the maximum stack size of 127.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:484
/home/shane/Documents/code/AssemblySimulator/tests/U
