[Killed] GreaterThanNegotiation
Simulator.php:594:13
         if ($stackOffset < 0) {
             $newBytesLength = ($stackOffset * -1);
 
-            if ($newBytesLength > $availableBytes) {
+            if ($newBytesLength <= $availableBytes) {
                 $message = sprintf(
                     'Exceeded maximum stack size. Attempted to allocate %d ' .
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOverwriteStackWithIdenticalOffset
RangeException: Exceeded maximum stack size. Attempted to allocate 2 new bytes to the stack, however it exceeds the maximum stack size of 127.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:484
/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:678

2) shanept\Assembl

[Killed] ConcatOperandRemoval
Simulator.php:596:21
 
             if ($newBytesLength > $availableBytes) {
                 $message = sprintf(
-                    'Exceeded maximum stack size. Attempted to allocate %d ' .
-                    'new bytes to the stack, however it exceeds the maximum ' .
-                    'stack size of %d.',
+                    $message = sprintf('Exceeded maximum stack size. Attempted to allocate %d ' . 'new bytes to the stack, however it exceeds the maximum ', $newBytesLength, $this->stackSize);
                     $newBytesLength,
                     $this->stackSize,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
Failed asserting that exception message 'Exceeded maximum stack size. Attempted to allocate 10 new bytes to the stack, however it exceeds the maximum ' contains 'Exceeded maximum stack size. Attempted to allocate 10 new bytes to the stack, however it exceeds the maximum stack size of 5.'.

FAILURES!
Tests: 76, Assertions: 128

[Killed] ConcatOperandRemoval
Simulator.php:596:21
 
             if ($newBytesLength > $availableBytes) {
                 $message = sprintf(
-                    'Exceeded maximum stack size. Attempted to allocate %d ' .
-                    'new bytes to the stack, however it exceeds the maximum ' .
+                    $message = sprintf('new bytes to the stack, however it exceeds the maximum ' . 'stack size of %d.', $newBytesLength, $this->stackSize);.
                     'stack size of %d.',
                     $newBytesLength,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
Failed asserting that exception message 'new bytes to the stack, however it exceeds the maximum stack size of 10.' contains 'Exceeded maximum stack size. Attempted to allocate 10 new bytes to the stack, however it exceeds the maximum stack size of 5.'.

FAILURES!
Tests: 81, Assertions: 136, Failures: 1.

[Killed] Throw_
Simulator.php:603:17
                     $this->stackSize,
                 );
 
-                throw new \RangeException($message);
+                new \RangeException($message);
             }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testWriteStackSize
Failed asserting that exception of type "RangeException" is thrown.

FAILURES!
Tests: 73, Assertions: 122, Failures: 1.

[Killed] Minus
Simulator.php:606:13
                 throw new \RangeException($message);
             }
 
-            $zeroPadAmount = $newBytesLength - $valueLength;
+            $zeroPadAmount = $newBytesLength + $valueLength;
 
             if ($zeroPadAmount > 0) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0403
+Binary String: 0x030400

[Killed] GreaterThanNegotiation
Simulator.php:608:13
 
             $zeroPadAmount = $newBytesLength - $valueLength;
 
-            if ($zeroPadAmount > 0) {
+            if ($zeroPadAmount <= 0) {
                 $value .= str_repeat("\0", $zeroPadAmount);
             }
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #1 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x040003)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x040003
+Binary String: 0x0403

[Killed] Assignment
Simulator.php:609:17
             $zeroPadAmount = $newBytesLength - $valueLength;
 
             if ($zeroPadAmount > 0) {
-                $value .= str_repeat("\0", $zeroPadAmount);
+                $value = str_repeat("\x00", $zeroPadAmount);
             }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #1 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x040003)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x040003
+Binary String: 0x0003

[Killed] UnwrapStrRepeat
Simulator.php:609:17
             $zeroPadAmount = $newBytesLength - $valueLength;
 
             if ($zeroPadAmount > 0) {
-                $value .= str_repeat("\0", $zeroPadAmount);
+                $value .= "\x00";
             }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #2 ([Binary String: 0x03, Binary String: 0x0201], Binary String: 0x0201000003)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0201000003
+Binary String: 0x02010003

[Killed] Concat
Simulator.php:613:13
             }
 
             // Prepend our value to the stack.
-            $this->stack = $value . $this->stack;
+            $this->stack = $this->stack . $value;
         } else {
             // We must overwrite the stack at the specified position.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0403
+Binary String: 0x0304

[Killed] ConcatOperandRemoval
Simulator.php:613:13
             }
 
             // Prepend our value to the stack.
-            $this->stack = $value . $this->stack;
+            $this->stack = $this->stack;
         } else {
             // We must overwrite the stack at the specified position.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetStack with data set #0 ([Binary String: 0x03, Binary String: 0x04], Binary String: 0x0403)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x0403
+''

[Killed] PublicVisibility
Simulator.php:632:5
      * @param int $offset The offset to clear.
      * @param int $bytes  The amount of bytes to clear (between offset and stackAddress).
      */
-    public function clearStackAt(int $offset, int $bytes): void
+    protected function clearStackAt(int $offset, int $bytes): void
     {
         if ($offset > $this->stackAddress) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackUnderflowThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackUnderflowThrowsException
Failed asserting that exception of type "Error" matches expected exception "shanept\AssemblySimulator\Exception\StackUnderflow". Message was: "Call to protected method shanept\AssemblySimulator\Simulator::clearStackAt() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest" at
/home/shane/Documents/

[Killed] UnwrapStrRepeat
Simulator.php:645:9
         }
 
         $stackLength = strlen($this->stack);
-        $clearString = str_repeat("\0", $bytes);
+        $clearString = "\x00";
 
         // This makes our offset relative to the start of the stack string.
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAt with data set #4 ([Binary String: 0x123456, 'C!', 'dh0f', 'BB', '????', Binary String: 0x1200330055], 8, Binary String: 0x1200330055ccc...1123456)
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-Binary String: 0x1200330055cccccccc4242000000004321123456
+Binary String: 0x1200330055cccccccc424200432112

[Killed] Minus
Simulator.php:648:9
         $clearString = str_repeat("\0", $bytes);
 
         // This makes our offset relative to the start of the stack string.
-        $stackOffset = $offset - ($this->stackAddress - $stackLength) - 1;
+        $stackOffset = $offset + ($this->stackAddress - $stackLength) - 1;
 
         if ($stackOffset < 0) {
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAt with data set #0 (['C', '2', 'e', 'CB'], 4, 'e2C')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'e2C'
+Binary String: 0x43426532430000

[Killed] ConcatOperandRemoval
Simulator.php:652:17
 
         if ($stackOffset < 0) {
             $message = sprintf(
-                'Stack offset 0x%X requested, but it exceeds the top of the ' .
-                'stack (0x%X)',
+                $message = sprintf('stack (0x%X)', $offset, $this->stackAddress - $stackLength);
                 $offset,
                 $this->stackAddress - $stackLength,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'stack (0x11D0)' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFE)'.

FAILURES!
Tests: 82, Assertions: 138, Failures: 1.

[Killed] Concat
Simulator.php:652:17
 
         if ($stackOffset < 0) {
             $message = sprintf(
-                'Stack offset 0x%X requested, but it exceeds the top of the ' .
-                'stack (0x%X)',
+                $message = sprintf('stack (0x%X)' . 'Stack offset 0x%X requested, but it exceeds the top of the ', $offset, $this->stackAddress - $stackLength);
                 $offset,
                 $this->stackAddress - $stackLength,
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'stack (0x11D0)Stack offset 0x3FFE requested, but it exceeds the top of the ' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFE)'.

FAILURES!
Tests: 77, Assertions: 130, Failures: 1.

[Killed] Minus
Simulator.php:655:17
                 'Stack offset 0x%X requested, but it exceeds the top of the ' .
                 'stack (0x%X)',
                 $offset,
-                $this->stackAddress - $stackLength,
+                $message = sprintf('Stack offset 0x%X requested, but it exceeds the top of the ' . 'stack (0x%X)', $offset, $this->stackAddress + $stackLength);
             );
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAtInvalidOffsetThrowsException
Failed asserting that exception message 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x4000)' contains 'Stack offset 0x11D0 requested, but it exceeds the top of the stack (0x3FFE)'.

FAILURES!
Tests: 79, Assertions: 133, Failures: 1.

[Killed] UnwrapLtrim
Simulator.php:669:9
             $bytes,
         );
 
-        $this->stack = ltrim($stack, "\0");
+        $this->stack = $stack;
     }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testClearStackAt with data set #0 (['C', '2', 'e', 'CB'], 4, 'e2C')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'e2C'
+Binary String: 0x0000653243

[Killed] PublicVisibility
Simulator.php:682:5
      *                    $length number of charactrs. See PHP strpos $length
      *                    for more information.
      */
-    public function getCodeBuffer($offset = null, $length = null): string
+    protected function getCodeBuffer($offset = null, $length = null): string
     {
         if (is_null($offset)) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testCodeBufferIsClearedAfterReset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testCodeBufferIsClearedAfterReset
Error: Call to protected method shanept\AssemblySimulator\Simulator::getCodeBuffer() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:331

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetAndGetCodeBuffer with dat

[Killed] IfNegation
Simulator.php:684:9
      */
     public function getCodeBuffer($offset = null, $length = null): string
     {
-        if (is_null($offset)) {
-            $offset = 0;
-        }
+        if (!is_null($offset)) {
 
         if (is_null($length)) {
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetAndGetCodeBuffer with data set #1 ('FullBuffer', 4, null, 'Buffer')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Buffer'
+'FullBuffer'

[Killed] DecrementInteger
Simulator.php:685:13
     public function getCodeBuffer($offset = null, $length = null): string
     {
         if (is_null($offset)) {
-            $offset = 0;
+            $offset = -1;
         }
 
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetAndGetCodeBuffer with data set #0 ('FullBuffer', null, null, 'FullBuffer')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'FullBuffer'
+'r'

[Killed] IfNegation
Simulator.php:688:9
             $offset = 0;
         }
 
-        if (is_null($length)) {
-            $length = strlen($this->buffer);
-        }
+        if (!is_null($length)) {
 
         return substr($this->buffer, $offset, $length);
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetAndGetCodeBuffer with data set #2 ('FullBuffer', null, 4, 'Full')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Full'
+'FullBuffer'

[Killed] UnwrapSubstr
Simulator.php:692:9
             $length = strlen($this->buffer);
         }
 
-        return substr($this->buffer, $offset, $length);
+        return $this->buffer;
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSetAndGetCodeBuffer with data set #1 ('FullBuffer', 4, null, 'Buffer')
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Buffer'
+'FullBuffer'

[Killed] PublicVisibility
Simulator.php:703:5
      *
      * @param int $length Optional. As per getCodeBuffer().
      */
-    public function getCodeAtInstruction($length = null): string
+    protected function getCodeAtInstruction($length = null): string
     {
         return $this->getCodeBuffer($this->iPointer, $length);
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::getCodeAtInstruction() from scope shanept\AssemblySimulator\Instruction\ExclusiveOr

/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:95
/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.p

[Killed] PublicVisibility
Simulator.php:714:5
      *
      * @param string $buffer The code buffer to be simulated.
      */
-    public function setCodeBuffer(string $buffer): void
+    protected function setCodeBuffer(string $buffer): void
     {
         $this->buffer = $buffer;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::setCodeBuffer() from scope shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:22

2) shanept\AssemblySimulatorTests\Integration\RexTest::test

[Killed] PublicVisibility
Simulator.php:722:5
     /**
      * Returns the size of the code buffer in bytes.
      */
-    public function getCodeBufferSize(): int
+    protected function getCodeBufferSize(): int
     {
         return strlen($this->buffer);
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testCodeBufferIsClearedAfterReset
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testCodeBufferIsClearedAfterReset
Error: Call to protected method shanept\AssemblySimulator\Simulator::getCodeBufferSize() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:332

ERRORS!
Tests: 110, Assertions: 95, Errors: 1, Skipped: 43.

[Killed] PublicVisibility
Simulator.php:730:5
     /**
      * Returns the current position of the instruction pointer.
      */
-    public function getInstructionPointer(): int
+    protected function getInstructionPointer(): int
     {
         return $this->iPointer;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultInstructionPointerIsZero
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testDefaultInstructionPointerIsZero
Error: Call to protected method shanept\AssemblySimulator\Simulator::getInstructionPointer() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:896

ERRORS!
Tests: 110, Assertions: 95, Errors: 1, Skipped: 43.

[Killed] PublicVisibility
Simulator.php:740:5
      *
      * @param int $instructionPointer The new value of the instruction pointer.
      */
-    public function setInstructionPointer(int $instructionPointer): void
+    protected function setInstructionPointer(int $instructionPointer): void
     {
         $this->iPointer = $instructionPointer;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetAndAdvanceInstructionPointer
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetAndAdvanceInstructionPointer
Error: Call to protected method shanept\AssemblySimulator\Simulator::setInstructionPointer() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:201

ERRORS!
Tests: 110, Assertions: 103, Errors: 1, Skipped: 36.

[Killed] PublicVisibility
Simulator.php:750:5
      *
      * @param int $amount The amount of bytes to advance the pointer by.
      */
-    public function advanceInstructionPointer(int $amount): void
+    protected function advanceInstructionPointer(int $amount): void
     {
         $this->iPointer += $amount;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Error: Call to protected method shanept\AssemblySimulator\Simulator::advanceInstructionPointer() from scope shanept\AssemblySimulator\Instruction\ExclusiveOr

/home/shane/Documents/code/AssemblySimulator/src/Instruction/ExclusiveOr.php:93
/home/shane/Documents/code/AssemblySimulator/src/Instruction/Exclusiv

[Killed] PlusEqual
Simulator.php:752:9
      */
     public function advanceInstructionPointer(int $amount): void
     {
-        $this->iPointer += $amount;
+        $this->iPointer -= $amount;
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetAndAdvanceInstructionPointer
Failed asserting that -2 matches expected 12.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:208

ERRORS!
Tests: 16, Assertions: 19, Errors: 2, Failures: 1.

[Killed] Assignment
Simulator.php:752:9
      */
     public function advanceInstructionPointer(int $amount): void
     {
-        $this->iPointer += $amount;
+        $this->iPointer = $amount;
     }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testGetAndSetAndAdvanceInstructionPointer
Failed asserting that 7 matches expected 12.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:208

ERRORS!
Tests: 16, Assertions: 19, Errors: 2, Failures: 1.

[Killed] Throw_
Simulator.php:763:13
     private function taintProtection(): void
     {
         if ($this->tainted) {
-            throw new Exception\Tainted(
-                'Attempted to operate a tainted environment. ' .
-                'Did you forget to reset?',
-            );
+            new Exception\Tainted('Attempted to operate a tainted environment. ' . 'Did you forget to reset?');
         }
     }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\InvalidOpcode" matches expected exception "shanept\AssemblySimulator\Exception\Tainted". Message was: "Encountered unknown opcode 0x90 at offset 0 (0x0)." at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/h

[Killed] ConcatOperandRemoval
Simulator.php:764:17
     {
         if ($this->tainted) {
             throw new Exception\Tainted(
-                'Attempted to operate a tainted environment. ' .
-                'Did you forget to reset?',
+                throw new Exception\Tainted('Did you forget to reset?');
             );
         }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
Failed asserting that exception message 'Did you forget to reset?' contains 'Attempted to operate a tainted environment. Did you forget to reset?'.

FAILURES!
Tests: 14, Assertions: 18, Failures: 1.

[Killed] ConcatOperandRemoval
Simulator.php:764:17
     {
         if ($this->tainted) {
             throw new Exception\Tainted(
-                'Attempted to operate a tainted environment. ' .
-                'Did you forget to reset?',
+                throw new Exception\Tainted('Attempted to operate a tainted environment. ');
             );
         }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
Failed asserting that exception message 'Attempted to operate a tainted environment. ' contains 'Attempted to operate a tainted environment. Did you forget to reset?'.

FAILURES!
Tests: 14, Assertions: 18, Failures: 1.

[Killed] IfNegation
Simulator.php:784:9
     private function processOpcodeWithRegisteredInstructions(int $opcode): bool
     {
         // Add our two-byte instruction prefix.
-        if ($this->hasPrefix(0x0F)) {
-            $opcode = 0xF00 | $opcode;
-        }
+        if (!$this->hasPrefix(0xf)) {
 
         foreach ($this->registeredInstructions as $record) {
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

ERRORS!
Tests: 36, Assertions: 42, Errors: 3, Failures: 1.

[Killed] DecrementInteger
Simulator.php:784:9
     private function processOpcodeWithRegisteredInstructions(int $opcode): bool
     {
         // Add our two-byte instruction prefix.
-        if ($this->hasPrefix(0x0F)) {
+        if ($this->hasPrefix(14)) {
             $opcode = 0xF00 | $opcode;
         }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] IncrementInteger
Simulator.php:785:13
     {
         // Add our two-byte instruction prefix.
         if ($this->hasPrefix(0x0F)) {
-            $opcode = 0xF00 | $opcode;
+            $opcode = 3841 | $opcode;
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] BitwiseOr
Simulator.php:785:13
     {
         // Add our two-byte instruction prefix.
         if ($this->hasPrefix(0x0F)) {
-            $opcode = 0xF00 | $opcode;
+            $opcode = 0xf00 & $opcode;
         }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] Foreach_
Simulator.php:788:9
             $opcode = 0xF00 | $opcode;
         }
 
-        foreach ($this->registeredInstructions as $record) {
-            // If this Instruction class doesn't handle this opcode, skip it.
-            if (! array_key_exists($opcode, $record['mappings'])) {
-                continue;
-            }
-
-            // This instruction class handles this opcode. Give it a go.
-            $callback = $record['mappings'][$opcode];
-            $response = call_user_func($callback);
-
-            // If we don't get a boolean response, throw an exception.
-            if (! is_bool($response)) {
-                $this->triggerInstructionHandlerException($callback, $response);
-            }
-
-            // If our mapping returns true, so do we. Otherwise, we continue.
-            if ($response) {
-                return true;
-            }
-        }
+        foreach ([] as $record) {
 
         // We could not process the opcode, so we return false.
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

ERRORS!
Tests: 36, Assertions: 42, Errors: 3, Failures: 1.

[Killed] LogicalNot
Simulator.php:790:13
 
         foreach ($this->registeredInstructions as $record) {
             // If this Instruction class doesn't handle this opcode, skip it.
-            if (! array_key_exists($opcode, $record['mappings'])) {
+            if (array_key_exists($opcode, $record['mappings'])) {
                 continue;
             }
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception of type "TypeError" matches expected exception "shanept\AssemblySimulator\Exception\InvalidOpcode". Message was: "call_user_func(): Argument #1 ($callback) must be a valid callback, no array or string given" at
/home/shane/Documents/code/AssemblySimulator/src/Si

[Killed] Continue_
Simulator.php:791:17
         foreach ($this->registeredInstructions as $record) {
             // If this Instruction class doesn't handle this opcode, skip it.
             if (! array_key_exists($opcode, $record['mappings'])) {
-                continue;
+                break;
             }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorSkipsNonMatchingOpcodeRegistrations
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorSkipsNonMatchingOpcodeRegistrations
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x01 at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:1077

2) shanept\AssemblySimulatorTests\Unit\Simulato
