[Killed] LogicalNot
Simulator.php:799:13
             $response = call_user_func($callback);
 
             // If we don't get a boolean response, throw an exception.
-            if (! is_bool($response)) {
+            if (is_bool($response)) {
                 $this->triggerInstructionHandlerException($callback, $response);
             }
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception of type "LogicException" matches expected exception "shanept\AssemblySimulator\Exception\InvalidOpcode". Message was: "Expected boolean return value from Closure, but received "true" instead." at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.

[Killed] MethodCallRemoval
Simulator.php:800:17
 
             // If we don't get a boolean response, throw an exception.
             if (! is_bool($response)) {
-                $this->triggerInstructionHandlerException($callback, $response);
+                
             }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\InvalidOpcode" matches expected exception "LogicException". Message was: "Encountered unknown opcode 0x01 at offset 1 (0x1)." at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/sha

[Killed] IfNegation
Simulator.php:804:13
             }
 
             // If our mapping returns true, so do we. Otherwise, we continue.
-            if ($response) {
-                return true;
-            }
+            if (!$response) {
         }
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 1 (0x10).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

ERRORS!
Tests: 36, Assertions: 43, Errors: 3, Failures: 1.

[Killed] TrueValue
Simulator.php:805:17
 
             // If our mapping returns true, so do we. Otherwise, we continue.
             if ($response) {
-                return true;
+                return false;
             }
         }
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F02 at offset 1 (0x10).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

ERRORS!
Tests: 36, Assertions: 43, Errors: 3, Failures: 1.

[Killed] FalseValue
Simulator.php:810:9
         }
 
         // We could not process the opcode, so we return false.
-        return false;
+        return true;
     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception of type "SebastianBergmann\Invoker\TimeoutException" matches expected exception "shanept\AssemblySimulator\Exception\InvalidOpcode". Message was: "Execution aborted after 1 second" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:689
/home/shane

[Killed] IfNegation
Simulator.php:831:9
         // Default for string functions. Will most likely be overwritten.
         $instructionName = $callback;
 
-        if (is_array($callback)) {
-            $className = $callback[0];
-
-            if (! is_string($className)) {
-                $className = get_class($className);
-            }
-
-            $instructionName = sprintf(
-                '%s::%s',
-                $className,
-                $callback[1],
-            );
-        } elseif (is_object($callback)) {
-            $instructionName = get_class($callback);
-        }
+        if (!is_array($callback)) {
 
         $message = sprintf(
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Cannot use object of type Closure as array" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:662
/home/shane/Documents/code/AssemblySimulator/src/Simulator.ph

[Killed] IncrementInteger
Simulator.php:832:13
         $instructionName = $callback;
 
         if (is_array($callback)) {
-            $className = $callback[0];
+            $className = $callback[1];
 
             if (! is_string($className)) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
Failed asserting that exception message 'Expected boolean return value from returnVoid::returnVoid, but received "NULL" instead.' contains 'Expected boolean return value from MockObject_TestVoidInstruction_0f049bce::returnVoid, but received "NULL" instead.'.

FAILURES!
Te

[Killed] LogicalNot
Simulator.php:834:13
         if (is_array($callback)) {
             $className = $callback[0];
 
-            if (! is_string($className)) {
+            if (is_string($className)) {
                 $className = get_class($className);
             }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Object of class MockObject_TestVoidInstruction_ba72f3ac could not be converted to string" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:666
/home

[Killed] DecrementInteger
Simulator.php:841:17
             $instructionName = sprintf(
                 '%s::%s',
                 $className,
-                $callback[1],
+                $instructionName = sprintf('%s::%s', $className, $callback[0]);
             );
         } elseif (is_object($callback)) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Object of class MockObject_TestVoidInstruction_cb763853 could not be converted to string" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:666
/home

[Killed] IncrementInteger
Simulator.php:841:17
             $instructionName = sprintf(
                 '%s::%s',
                 $className,
-                $callback[1],
+                $instructionName = sprintf('%s::%s', $className, $callback[2]);
             );
         } elseif (is_object($callback)) {
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredInstantiatedClassDoesntReturnBool
Failed asserting that exception message 'Expected boolean return value from MockObject_TestVoidInstruction_15fb7285::, but received "NULL" instead.' contains 'Expected boolean return value from MockObject_TestVoidInstruction_15fb7285::returnVoid, but received "NULL" inste

[Killed] ElseIfNegation
Simulator.php:843:9
                 $className,
                 $callback[1],
             );
-        } elseif (is_object($callback)) {
-            $instructionName = get_class($callback);
-        }
+        } elseif (!is_object($callback)) {
 
         $message = sprintf(
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfRegisteredClosureDoesntReturnBool
Failed asserting that exception of type "Error" matches expected exception "LogicException". Message was: "Object of class Closure could not be converted to string" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:670
/home/shane/Documents/code/AssemblySimulator/sr

[Killed] PublicVisibility
Simulator.php:859:5
     /**
      * Parses a binary string of assembly to move values around in registers.
      */
-    public function simulate(): void
+    protected function simulate(): void
     {
         $this->taintProtection();
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testModeChangeWithoutResetThrowsException
Failed asserting that exception of type "Error" matches expected exception "shanept\AssemblySimulator\Exception\Tainted". Message was: "Call to protected method shanept\AssemblySimulator\Simulator::simulate() from scope shanept\AssemblySimulatorTests\Unit\SimulatorTest" at
/home/shane/Documents/code/Ass

[Killed] LessThanNegotiation
Simulator.php:866:9
         $assembly_length = strlen($this->buffer);
 
         // Set up our instruction pointer then loop through until the end.
-        for (; $this->iPointer < $assembly_length;) {
+        for (; $this->iPointer >= $assembly_length;) {
             $op = ord($this->buffer[$this->iPointer]);
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThan
Simulator.php:866:9
         $assembly_length = strlen($this->buffer);
 
         // Set up our instruction pointer then loop through until the end.
-        for (; $this->iPointer < $assembly_length;) {
+        for (; $this->iPointer <= $assembly_length;) {
             $op = ord($this->buffer[$this->iPointer]);
 
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x00 at offset 3 (0x3).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:23

2) shanept\AssemblySimulatorTests\Integration\Re

[Killed] DecrementInteger
Simulator.php:869:13
         for (; $this->iPointer < $assembly_length;) {
             $op = ord($this->buffer[$this->iPointer]);
 
-            $isTwoByteOp = $this->hasPrefix(0x0F);
+            $isTwoByteOp = $this->hasPrefix(14);
 
             // Go through our supported instructions.
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x04 at offset 3 (0x12).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] IncrementInteger
Simulator.php:869:13
         for (; $this->iPointer < $assembly_length;) {
             $op = ord($this->buffer[$this->iPointer]);
 
-            $isTwoByteOp = $this->hasPrefix(0x0F);
+            $isTwoByteOp = $this->hasPrefix(16);
 
             // Go through our supported instructions.
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x04 at offset 3 (0x12).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] IncrementInteger
Simulator.php:874:17
             // Go through our supported instructions.
             switch (true) {
                 // 0F: Two-byte Instructions
-                case $op == 0x0F && $this->mode !== self::REAL_MODE:
+                case $op == 16 && $this->mode !== self::REAL_MODE:
 
                 case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F at offset 0 (0xF).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] AssignmentEqual
Simulator.php:874:17
             // Go through our supported instructions.
             switch (true) {
                 // 0F: Two-byte Instructions
-                case $op == 0x0F && $this->mode !== self::REAL_MODE:
+                case ($op = 0xf) && $this->mode !== self::REAL_MODE:
 
                 case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Simulator.php:876:17
                 // 0F: Two-byte Instructions
                 case $op == 0x0F && $this->mode !== self::REAL_MODE:
 
-                case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
+                case $op == 0x66 && $this->mode !== self::REAL_MODE && $isTwoByteOp:
                 case $op == 0x67 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
                     $this->prefixes[] = $op;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x66 at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:23

2) shanept\AssemblySimulatorTests\Unit\Simulator

[Killed] Equal
Simulator.php:876:17
                 // 0F: Two-byte Instructions
                 case $op == 0x0F && $this->mode !== self::REAL_MODE:
 
-                case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
+                case $op != 0x66 && $this->mode !== self::REAL_MODE && !$isTwoByteOp:
                 case $op == 0x67 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
                     $this->prefixes[] = $op;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
Failed asserting that 9223372036854775807 matches expected 5380300354831952554.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/RexTest.php:33

ERRORS!
Tests: 2, Assertions: 1, Errors: 1, Failures: 1.

[Killed] LogicalAndNegation
Simulator.php:877:17
                 case $op == 0x0F && $this->mode !== self::REAL_MODE:
 
                 case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
-                case $op == 0x67 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
+                case !($op == 0x67 && $this->mode !== self::REAL_MODE && !$isTwoByteOp):
                     $this->prefixes[] = $op;
                     $this->iPointer++;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Simulator.php:877:17
                 case $op == 0x0F && $this->mode !== self::REAL_MODE:
 
                 case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
-                case $op == 0x67 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
+                case $op == 104 && $this->mode !== self::REAL_MODE && !$isTwoByteOp:
                     $this->prefixes[] = $op;
                     $this->iPointer++;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOp67IsRecordedAsPrefixInProtectedMode
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testOp67IsRecordedAsPrefixInProtectedMode
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x67 at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:1388

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::

[Killed] Increment
Simulator.php:879:21
                 case $op == 0x66 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
                 case $op == 0x67 && $this->mode !== self::REAL_MODE && ! $isTwoByteOp:
                     $this->prefixes[] = $op;
-                    $this->iPointer++;
+                    $this->iPointer--;
 
                     // If we don't continue to the outer loop, we will clear our
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testTwoByteInstructionIsCalledInProtectedAndLongModes with data set #0 (2)
shanept\AssemblySimulatorTests\Fakes\TestAssemblyInstruction::mockableCallback(): bool was not expected to be called more than once.

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:631
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:702
/ho

[Killed] DecrementInteger
Simulator.php:883:21
 
                     // If we don't continue to the outer loop, we will clear our
                     // prefix, REX bit and two byte instruction prefix.
-                    continue 2;
+                    continue 1;
 
                 case ($op >= 0x40 &&
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 0 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalAndNegation
Simulator.php:885:17
                     // prefix, REX bit and two byte instruction prefix.
                     continue 2;
 
-                case ($op >= 0x40 &&
-                      $op <= 0x4f
-                      && ! $isTwoByteOp
-                      && $this->mode === self::LONG_MODE):
+                case !($op >= 0x40 && $op <= 0x4f && !$isTwoByteOp && $this->mode === self::LONG_MODE): === self::LONG_MODE):
 
                     $this->prefixes[] = $op;
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
Failed asserting that 9223372036854775807 matches expected 9223372036854710272.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/Modes/LongModeTest.php:26

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThanOrEqualToNegotiation
Simulator.php:885:17
                     // prefix, REX bit and two byte instruction prefix.
                     continue 2;
 
-                case ($op >= 0x40 &&
+                case $op < 0x40 && $op <= 0x4f && !$isTwoByteOp && $this->mode === self::LONG_MODE:
                       $op <= 0x4f
                       && ! $isTwoByteOp
killedBy: shanept\AssemblySimulatorTests\Integration\Modes\LongModeTest::testOp66Uses16bitRegister
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception of type "shanept\AssemblySimulator\Exception\InvalidOpcode" is thrown.

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] LessThanOrEqualToNegotiation
Simulator.php:886:23
                     continue 2;
 
                 case ($op >= 0x40 &&
-                      $op <= 0x4f
+                      case $op >= 0x40 && $op > 0x4f && !$isTwoByteOp && $this->mode === self::LONG_MODE:
                       && ! $isTwoByteOp
                       && $this->mode === self::LONG_MODE):
killedBy: shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
statusReason: 1) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x4D at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Integration/RexTest.php:28

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexOnLongModeIs

[Killed] LessThanOrEqualTo
Simulator.php:886:23
                     continue 2;
 
                 case ($op >= 0x40 &&
-                      $op <= 0x4f
+                      case $op >= 0x40 && $op < 0x4f && !$isTwoByteOp && $this->mode === self::LONG_MODE:
                       && ! $isTwoByteOp
                       && $this->mode === self::LONG_MODE):
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexOnLongModeIsRecorded with data set #15 (79)
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x4F at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:1253

ERRORS!
Tests: 112, Assertions: 176, Errors:

[Killed] LogicalNot
Simulator.php:887:23
 
                 case ($op >= 0x40 &&
                       $op <= 0x4f
-                      && ! $isTwoByteOp
+                      case $op >= 0x40 && $op <= 0x4f && $isTwoByteOp && $this->mode === self::LONG_MODE:
                       && $this->mode === self::LONG_MODE):
 
killedBy: shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
statusReason: 1) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x4D at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Integration/RexTest.php:28

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexPrefixTreate

[Killed] Identical
Simulator.php:888:23
                 case ($op >= 0x40 &&
                       $op <= 0x4f
                       && ! $isTwoByteOp
-                      && $this->mode === self::LONG_MODE):
+                      case $op >= 0x40 && $op <= 0x4f && !$isTwoByteOp && $this->mode !== self::LONG_MODE:
 
                     $this->prefixes[] = $op;
killedBy: shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
statusReason: 1) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0x4D at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:718
/home/shane/Documents/code/AssemblySimulator/tests/Integration/RexTest.php:28

2) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexOnLongModeIs

[Killed] Increment
Simulator.php:892:21
 
                     $this->prefixes[] = $op;
                     $this->rex = $op;
-                    $this->iPointer++;
+                    $this->iPointer--;
 
                     // If we don't continue to the outer loop, we will clear our
killedBy: shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testRexOnLongModeIsRecorded with data set #0 (64)
Failed asserting that -1 matches expected 1.

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorTest.php:1239
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:631
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:702
/home/shane/Documents/code/AssemblySi

[Killed] IfNegation
Simulator.php:911:21
                         'Encountered unknown opcode 0x%02X at offset %d (0x%X).';
                     $iPointer = $this->iPointer;
 
-                    if ($isTwoByteOp) {
-                        $iPointer--;
-                        $format = 'Encountered unknown opcode 0x0F%02X at ' .
-                                  'offset %d (0x%X).';
-                    }
+                    if (!$isTwoByteOp) {
 
                     $address = $this->addressBase + $iPointer;
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F01 at offset -1 (0xE).' contains 'Encountered unknown opcode 0x01 at offset 0 (0xF).'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Decrement
Simulator.php:912:25
                     $iPointer = $this->iPointer;
 
                     if ($isTwoByteOp) {
-                        $iPointer--;
+                        $iPointer++;
                         $format = 'Encountered unknown opcode 0x0F%02X at ' .
                                   'offset %d (0x%X).';
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F04 at offset 4 (0x13).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] Concat
Simulator.php:913:25
 
                     if ($isTwoByteOp) {
                         $iPointer--;
-                        $format = 'Encountered unknown opcode 0x0F%02X at ' .
-                                  'offset %d (0x%X).';
+                        $format = 'offset %d (0x%X).' . 'Encountered unknown opcode 0x0F%02X at ';
                     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'offset 4 (0x2).Encountered unknown opcode 0x0F11 at ' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] ConcatOperandRemoval
Simulator.php:913:25
 
                     if ($isTwoByteOp) {
                         $iPointer--;
-                        $format = 'Encountered unknown opcode 0x0F%02X at ' .
-                                  'offset %d (0x%X).';
+                        $format = 'offset %d (0x%X).';
                     }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'offset 4 (0x2).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.
