[Killed] Plus
Simulator.php:917:21
                                   'offset %d (0x%X).';
                     }
 
-                    $address = $this->addressBase + $iPointer;
+                    $address = $this->addressBase - $iPointer;
                     $message = sprintf($format, $op, $iPointer, $address);
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfTwoByteOpcodeIsNotRegistered
Failed asserting that exception message 'Encountered unknown opcode 0x0F04 at offset 2 (0xD).' contains 'Encountered unknown opcode 0x0F04 at offset 2 (0x11).'.

FAILURES!
Tests: 33, Assertions: 42, Failures: 1.

[Killed] Throw_
Simulator.php:920:21
                     $address = $this->addressBase + $iPointer;
                     $message = sprintf($format, $op, $iPointer, $address);
 
-                    throw new Exception\InvalidOpcode($message, $op);
+                    new Exception\InvalidOpcode($message, $op);
             }
 
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorTest::testSimulatorThrowsExceptionIfOpcodeIsNotRegistered
Failed asserting that exception of type "SebastianBergmann\Invoker\TimeoutException" matches expected exception "shanept\AssemblySimulator\Exception\InvalidOpcode". Message was: "Execution aborted after 1 second" at
/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:305
/home/shane

[Killed] DecrementInteger
Simulator.php:924:13
             }
 
             // Reset our REX bit.
-            $this->rex = 0;
+            $this->rex = -1;
             $this->prefixes = [];
         }
killedBy: shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
statusReason: 1) shanept\AssemblySimulatorTests\Integration\RexTest::testNonRexOpAfterRexOp
Failed asserting that 9223372036854775807 matches expected 5380300354831952554.

/home/shane/Documents/code/AssemblySimulator/tests/Integration/RexTest.php:33

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
