[Killed] PublicVisibility
SimulatorFactory.php:40:5
      *             FQCN to load into the simulator. These will take processing
      *             priority over the default instruction set.
      */
-    public static function createSimulator(
+    protected static function createSimulator(int $simulatorMode = Simulator::REAL_MODE, array $additionalInstructions = []): Simulator
         int $simulatorMode = Simulator::REAL_MODE,
         array $additionalInstructions = [],
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryReturnsSimulatorInstance
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryReturnsSimulatorInstance
Error: Call to protected method shanept\AssemblySimulator\SimulatorFactory::createSimulator() from scope shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorFactoryTest.php:55

ERRORS!
Tests: 3, Assertions: 1, Errors: 1, Skipped: 1.

[Killed] Foreach_
SimulatorFactory.php:56:9
 
         $simulator = new Simulator($simulatorMode);
 
-        foreach ($instructionSet as $instructionClass) {
-            $instructionInstance = new $instructionClass();
-            $instructionInstance->setSimulator($simulator);
-        }
+        foreach ([] as $instructionClass) {
 
         return $simulator;
killedBy: shanept\AssemblySimulatorTests\Integration\SimulatorFactoryTest::testFactoryRegistersAdditionalInstructionsInOrder
statusReason: 1) shanept\AssemblySimulatorTests\Integration\SimulatorFactoryTest::testFactoryRegistersAdditionalInstructionsInOrder
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0xE8 at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:920
/home/shane/Documents/code/AssemblySimulator/tests/Integration/SimulatorFactoryTest.php:55

ERRORS!
Tests: 3, As

[Killed] MethodCallRemoval
SimulatorFactory.php:58:13
 
         foreach ($instructionSet as $instructionClass) {
             $instructionInstance = new $instructionClass();
-            $instructionInstance->setSimulator($simulator);
+            
         }
 
killedBy: shanept\AssemblySimulatorTests\Integration\SimulatorFactoryTest::testFactoryRegistersAdditionalInstructionsInOrder
statusReason: 1) shanept\AssemblySimulatorTests\Integration\SimulatorFactoryTest::testFactoryRegistersAdditionalInstructionsInOrder
shanept\AssemblySimulator\Exception\InvalidOpcode: Encountered unknown opcode 0xE8 at offset 0 (0x0).

/home/shane/Documents/code/AssemblySimulator/src/Simulator.php:920
/home/shane/Documents/code/AssemblySimulator/tests/Integration/SimulatorFactoryTest.php:55

ERRORS!
Tests: 3, As

[Killed] PublicVisibility
SimulatorFactory.php:70:5
      *
      * @return InstructionList
      */
-    public static function getDefaultInstructionSet(): array
+    protected static function getDefaultInstructionSet(): array
     {
         return [
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryDefaultInstructionsIncludeAllClasses
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryDefaultInstructionsIncludeAllClasses
Error: Call to protected method shanept\AssemblySimulator\SimulatorFactory::getDefaultInstructionSet() from scope shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest

/home/shane/Documents/code/AssemblySimulator/tests/Unit/SimulatorFactoryTest.php:45

ERRORS!
Tests: 3, Assertions: 4, E

[Killed] ArrayItemRemoval
SimulatorFactory.php:72:9
      */
     public static function getDefaultInstructionSet(): array
     {
-        return [
-            Call::class,
-            ExclusiveOr::class,
-            LoadEffectiveAddress::class,
-            Move::class,
-            NoOperation::class,
-            Pop::class,
-            Push::class,
-        ];
+        return [ExclusiveOr::class, LoadEffectiveAddress::class, Move::class, NoOperation::class, Pop::class, Push::class];
     }
 }
killedBy: shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryDefaultInstructionsIncludeAllClasses
statusReason: 1) shanept\AssemblySimulatorTests\Unit\SimulatorFactoryTest::testFactoryDefaultInstructionsIncludeAllClasses
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    0 => 'shanept\AssemblySimulator\Instruction\Call'
-    1 => 'shanept\AssemblySimulator\Instruction\ExclusiveOr'
